[
  {
    "municipality": "Barrie, City of",
    "source_type": "other",
    "title": "City of Barrie",
    "date": null,
    "source_url": "http://www.barrie.ca/Pages/default.aspx",
    "text": "<iframe src=https://www.googletagmanager.com/ns.html?id=GTM-W3L5D9H height=\"0\" width=\"0\" style=\"display:none;visibility:hidden\"></iframe> Skip to main content Skip to main menu Skip to footer Significant Weather Event DeclaredUpdated: January 16, 2026Alert level: HighState of Emergency to Address EncampmentsUpdated: November 6, 2025Alert level: High Previous SlideShow slide number 1Show slide number 2Show slide number 3 Next Slide Christmas tree collectionGet full details on Christmas tree collection, which is taking place weekly in January. New requirementsNew carbon monoxide alarm requirements are now in effect. Get full details. Applications open!Eligible organizations can apply for Arts & Culture Investment Program funding until January 19. Service BarrieCurbside CollectionCity CareersTransitPermits & LicencesCommunity EventsRecreation Programs Meeting AgendasBusiness DevelopmentCurbside Collection RegistrationBids & TendersBusiness & Employer DataSponsorship ProgramPermits & LicencesTourismFire InspectionsCommunity EventsWaterfrontParks & AmenitiesTrailsParkingTransitGO TransitTourismLatest NewsNews & NoticesSubscribe to e-newsCity continues snow removal efforts as Significant Weather Event remains in effectJan 16City invites property owners to apply for funding for heritage conservation projectsJan 14City offering 50 per cent off building permit application fees for additional residential unitsJan 13Featured ProjectsCurrent Projects & InitiativesBayview Drive Transportation ImprovementsConstruction includes lane widening, infrastructure replacements, new bike lanes, and a new sidewalk.McKay Road East Watermain & Trunk Sanitary SewerThe City's Active Transportation Master Plan identified McKay Road East as a key transportation corridor and recommended several transportation improvements to accommodate the growth of Barrie to 2031.Barrie Fire & Emergency Service Station 6Completed in November 2025. This new fire station is an important addition to our community, strategically located to serve the growing development in Barrie's southeast area.Building Progress in BarrieTo manage growth and to ensure services and facilities keep pace, the City has a vision and strategy for growth management, and is committed to doing our part to help get more homes, built faster.Building Progress in BarrieTo manage growth and to ensure services and facilities keep pace, the City has a vision and strategy for growth management, and is committed to doing our part to help get more homes, built faster.Mark Your CalendarEvents Calendar 55+ Advance Care Planning- The MusicalJanuary 19, 2026 - 1:30pm Starting Your Business Basics - WebinarJanuary 20, 2026 - 12:00pm Learning Lab - Marketing: Connecting with a Diverse ClienteleJanuary 21, 2026 - 12:00pmFeatured MeetingsView All MeetingsPublic Meeting re Proposed Amendment to the Official PlanFeb 4 - 6:00pm"
  },
  {
    "municipality": "Belleville, City of",
    "source_type": "other",
    "title": "City of Belleville",
    "date": null,
    "source_url": "http://www.belleville.ca/",
    "text": "Close Alert Banner Land Acknowledgement The City of Belleville acknowledges we are meeting today on the territory of the Huron-Wendat, the Anishinaabeg, and the Haudenosaunee people. We recognize and honour the historic relationship of the Indigenous peoples to this land, and acknowledge our shared obligation to respect, honour, and sustain these lands and the natural resources contained within. We recognize all First Nations, Métis, and Inuit who call Belleville their home, and support the need for cultivating a strong relationship with them. We look forward fostering a path towards reconciliation and show respect for the Indigenous peoples who first lived and currently live on the land where we now all reside together. A great place to live The city of Belleville is located on the north shore of the Bay of Quinte. Ideally situated between Toronto and Montreal, and less than one hour from the U.S. border, Belleville truly is at the center of it all. Approximately 55,000 people make Belleville their home and over 200,000 live within 30 minutes of the city. Belleville’s bustling city streets contrast the rolling rural landscapes that surround them. LibraryExplore Belleville Public Library and GalleryBelleville Library and Gallery are community meeting places that support and inspire lifelong learning, creativity, growth and success.HistoryVisit the Belleville and Hastings ArchivesWe preserve the history of our Eastern Ontario community through the records of local governments, individuals, families, businesses and organizations.TourismGlanmore National Historic SiteVisit Glanmore, a site of national historic significance proudly serving as Belleville's community museum. Discover restored rooms in this 1880's mansion as well as artifacts related to local history.RecreationQuinte Sports and Wellness CentreAll ages are welcome in the recreation facility where resources and our helpful staff are committed in providing quality services to help get you active. What's new View all news Loading News Feed... Keep in Touch The City of Belleville is committed to providing the community with information about local news and events. Subscribe to our news portal or any of the social medial platforms below to receive the latest updates and notifications. Close Search Pop Up Search I Want To... Close I Want To menu Search Close Old Browser Notification Browser Compatibility Notification It appears you are trying to access this site using an outdated browser. As a result, parts of the site may not function properly for you. We recommend updating your browser to its most recent version at your earliest convenience."
  },
  {
    "municipality": "Belleville, City of",
    "source_type": "council",
    "title": "Accessibility\n        - City of Belleville",
    "date": null,
    "source_url": "http://www.belleville.ca/en/city-hall/accessibility.aspx",
    "text": "Close Alert Banner Accessibility Decrease text size Default text size Increase text size Print This Page Share This Page Facebook Twitter LinkedIn Email Menu The City of Belleville is committed providing accessible and inclusive municipal goods, services, programs and facilities by removing barriers, supporting accessible planning and raising public awareness. Council and staff work in collaboration with the Accessibility Advisory Committee on planning and decision making throughout the five areas addressed through the AODA, under the Integrated Accessibility Standards Regulation (IASR): Customer Service, Information and Communications, Employment, Transportation, and the Design of Public Spaces. View the City's 2025 Accessibility Compliance Report Learn more about the services we provide, our Multi-Year Accessibility Plan and how you can provide your feedback below.Services and FacilitiesAccessibility Excellence AwardsMulti-Year Accessibility PlanPlans and PoliciesAccessibility Advisory CommitteeFeedback and RequestsResources Income Tax and Benefit Return Information The Belleville Accessibility Advisory Committee and the Belleville Public Library hosted guest speaker, Jeremy Bertrand, Senior Program Advisory Specialist from the Ontario Ministry of Finance | Advisory, Objections, Appeals & Services Branch | Public Education, Program Communication & Outreach Unit. His presentation, \"Getting the Most Out of Your Personal Income and Benefit Return From a Disability Perspective\" offered insightful and useful information. The tax return is your application form for various tax credits and benefits that you are entitled to, therefore, it is important to file a tax return even if you don’t owe tax or have income. Learn more about Ontario’s personal income tax and the Federal/Ontario tax return Helpful Canada Revenue Agency resources: Guide RC4064 – Disability-related information Guide RC4065 – Medical expenses There are many tax credits and benefits you should know about, including: Caregiver-related tax credits Disability-related tax credits Medical expense tax credits Ontario seniors care at home tax credit The Ontario Ministry of Finance runs a series of free webinars to help educate the public. You do need to register for the webinars such as: Discover Ontario’s Medical Expense and Seniors Care at Home Tax Credit: This webinar contains information that is applicable to non-seniors). From a Maze to Amazing – Understanding Ontario’s Personal Income Tax, Credits and Benefits. Currently there are four webinars listed for 2025. Ontario’s Credits, Benefits and Supports for Seniors with Lower Income: Currently there are four webinars listed for 2025. The Federal Government also has a series of free and recorded tax webinars on issues such as: Benefits and credits for adults 65 years and older Benefits and credits for persons with disabilities and their caregivers Disability tax credit (DTC) – Fully digital application form for applicants Please note: The Accessibility Coordinator for the City of Belleville is unable to assist with any other tax information. For more information, please go to the links above or call the Ontario Ministry of Finance at 1-866-668-8297 or TTY at 1-800-263-7776. You can reach the Canada Revenue Agency Benefits line at 1-800-387-1193. Employment Resources – Belleville residents who are Deaf or have a disability: did you know? There is a site specifically focused on connecting people with disabilities to employers that are looking to hire! Check out: jobsability.ca Get In Touch Stay up-to-date Subscribe to this page to get notified when this page has updated content. Notify Me Close Search Pop Up Search I Want To... Close I Want To menu Search Close Old Browser Notification Browser Compatibility Notification It appears you are trying to access this site using an outdated browser. As a result, parts of the site may not function properly for you. We recommend updating your browser to its most recent version at your earliest convenience."
  },
  {
    "municipality": "Belleville, City of",
    "source_type": "other",
    "title": "Employment Opportunities\n        - City of Belleville",
    "date": null,
    "source_url": "http://www.belleville.ca/en/city-hall/employmentopportunities.aspx?_mid_=27446",
    "text": "Close Alert Banner Employment Opportunities Decrease text size Default text size Increase text size Print This Page Share This Page Facebook Twitter LinkedIn Email Menu Click the link below to open up our job board. See Jobs! Get In Touch Stay up-to-date Subscribe to this page to get notified when this page has updated content. Notify Me Close Search Pop Up Search I Want To... Close I Want To menu Search Close Old Browser Notification Browser Compatibility Notification It appears you are trying to access this site using an outdated browser. As a result, parts of the site may not function properly for you. We recommend updating your browser to its most recent version at your earliest convenience."
  },
  {
    "municipality": "Belleville, City of",
    "source_type": "council",
    "title": "Rates and Fees\n        - City of Belleville",
    "date": null,
    "source_url": "http://www.belleville.ca/en/city-hall/rates-and-fees.aspx",
    "text": "Close Alert Banner Rates and Fees Decrease text size Default text size Increase text size Print This Page Share This Page Facebook Twitter LinkedIn Email Menu The Consolidated Fees and Charges By-law establishes the rates and fees to be charged by the City for services provided. In December, Council passed a new by-law (By-law 2025-195) to set the fees and charges for 2026 which took effect Jan. 1. How are fees and charges set? User fees and charges are an important part of revenue generation for the City, and are adjusted annually to be reflective of reasonable cost recovery and comparability with other municipalities. They are reviewed and adjusted each year to ensure a fair balance between what users pay and what taxes cover. Operational reviews may also impact rates. For example, the Transit Master Plan which was undertaken in 2023, identified ways to improve transit over a five-year period while ensuring balanced cost recovery through annual fare increases, with a target of recovering 35% of costs through fees and charges (leaving 65% of costs to be subsidized through taxes). The User Fees Study which was approved in 2024, reviewed the funding approach for parks, recreation and culture programs/services, including how it should balance taxation-funded subsidization with user fees. The target for cost-recovery for recreation programs, for example, was set at the range of 20-40% of costs (leaving 60-80% of costs to be subsidized through taxes). Target cost recovery for each area is laid out in each department's operating budget each year and is reviewed as part of the budget process. The City’s water and wastewater systems, however, operate independently from tax-supported services. All operating and capital costs are fully recovered through water and wastewater rates and charges, ensuring these systems are self-sustaining. 2026 Fees and Charges The below fees were approved by council during the Dec. 8, 2025 council meeting and went into effect Jan. 1, 2026. Search fees Search Clear Index Department Active Transportation Animal Control Building Community Services Corporate Services Donation Program - Parks Economic Development Engineering Environmental Services Finance Fire & Emergency Services Planning TOS Transit Water Active Transportation Description2025 Fee Did operate a vehicle in a prohibited portion of a bicycle lane110 Did operate a vehicle on a multi-use trail110 Did operate an e-bike or vehicle on a sidewalk or Downtown sidewalk110 Did pedal an e-bike on a sidewalk or Downtown sidewalk110 While over the age of 14, did operate a bicycle on a sidewalk65 Did operate or use a bicycle, skateboard, in-line skates or roller skates on a sidewalk in the Downtown65 Did operate or use a skateboard, in-line skates or roller skates on a prohibited Highway outside of a bicycle lane110 Did operate or use a bicycle, skateboard, in-line skates, roller skates or Segway contrary to a traffic control device or traffic signal110 While under the age of 18, did operate or use a skateboard, in-line skates or roller skates without wearing a helmet80 Did between dusk and dawn operate or use a bicycle, skateboard, in-line skates, roller skates, or Segway without using prescribed lights80 Did between dusk and dawn operate or use a bicycle, skateboard, in-line skates, roller skates or Segway without wearing prescribed reflective clothing80 Did fail to yield to a pedestrian while operating or using a bicycle, skateboard, in-line skates, roller skates, Segway or e-bike180 Did interfere with a vehicle or bicycle being operated in accordance with the Highway Traffic Act while operating or using a skateboard, in-line skates, roller skates, Segway or e-bike110 In the absence of sign permitting otherwise, did fail to dismount from a bicycle or skateboard when crossing a Highway intersection110 Did by leaving a bicycle, e-bike or Segway, obstruct a vehicle on a Highway110 Did, by leaving a bicycle, e-bike, or Segway, obstruct a pedestrian on a sidewalk, multi-use trail, driveway, ramp or building entrance65 Did, by leaving a bicycle, e-bike, Segway, obstruct a parking meter65 Animal Control Description2025 Fee2026 Fee KennelKennel Licence Fee62150 Dog Tags - Intact Dogs Tag purchased in the licencing year26$50 intact dogs $40 for owners 65+yrs Tag purchased during the year of tag33.8 Dog Tags - Spayed or Neutered Dog (See Special Provision 1) Tag purchased in the licencing year21$30 spayed/neutered dogs$20 for owners $65+ Tag purchased during the year of tag28.6 Senior Citizen Rates - Owner over age of sixty-five (65) Male or Female Dog - tag purchased during December in the year preceding the year of the tag15 Tag purchased during the year23.4 Spayed or Neutered - tag purchased in December of year preceding the year of the tag10.4 Spayed or Neutered - tag purchased during the tag year15.6 Replacement fee for lost tag5.210 Replacement fee for licencing new dog to replace deceased dog5.210 Impound Fee $100 + $25 daily care fee for the extent of the 5 day redemption period excluding impound day Special Provisions1. Veterinarian’s Certificate is necessary to certify that dogs have been spayed or neutered and immunized2. The owner or a properly certified guide dog shall not be required to obtain a tag for such dog3. The tag fee for dogs registered for the following year, in accordance with the terms of the By-Law, after September 30th shall be 50% of the fees specified above.4. The tag fee for newly adopted dogs, puppies, or new residents within a calendar tag year be reduced by 50% of the fees specific above. Building Description2025 Fee2026 Fee Building Permits - Residential Building Permits (new/addition)Minimum $100Minimum $100 Residential (3 units or less)$12.00 per sq m$12.00 per sq m Residential (4 units or more)$16.50 per sq m$16.50 per sq m Commercial $17.00 per sq m$17.00 per sq m Industrial$12.00 per sq m$12.00 per sq m Institutional $22.00 per sq m$22.00 per sq m Attached Garage$5.00 per sq m$5.00 per sq m Detached Garages and Accessory Structures$7.50 per sq m$7.50 per sq m Building Permits - Commercial Building Permits (new/addition)Minimum $100Minimum $100 Commercial – Base Building (no occupancy permitted)$13.50 per sq m$13.50 per sq m Commercial – Interior Fit-Up$3.50 per sq m$3.50 per sq m *Industrial - Base Building (no occupancy permitted)$10.00 per sq m$10.00 per sq m *Industrial - Interior Fit-up$2.00 per sq m$2.00 per sq m Building Permits - Independent or Supplementary Independent or SupplementaryMinimum $100Minimum $100 Finished basement$5.50 per sq m$5.50 per sq m Additional Dwelling Unit$7.00 per sq m$7.00 per sq m Fireplace Insert Permit100100 Wood Burning Appliance Permit$10.00 per $1,000.00 construction value$10.00 per $1,000.00 construction value Commercial Kitchen Exhaust Hood Permit$10.00 per $1,000.00 construction value$10.00 per $1,000.00 construction value Building Permits - Repair or Alterations Repair or AlterationsMinimum $100Minimum $100 Renovations/ Alterations (do not fit into a category above)Minimum $100$10.00 per $1,000.00 construction valueMinimum $100$10.00 per $1,000.00 construction value Plumbing Permits Plumbing PermitsMinimum $50Minimum $50 Residential$15.00 per unit + $7.00 per fixture$15.00 per unit + $7.00 per fixture Other$75 per unit + $7.00 per fixture $75 per unit + $7.00 per fixture Underground5050 Site Service Permit Site Service PermitMinimum $100Minimum $100 Sewer Pipe$2.50 per meter$2.50 per meter Catch Basins and Manholes$50 each$50 each Occupancy Permit Per suite/unit/residential unit/permit/building2020 Sewage System Permit *New - Class 1No FeeNo Fee Class 2, 3, 4 or 5 (New)640640 Repair, Alteration, or Addition150150 Demolition Permit Main Building100100 Accessory Building100100 Other Permits Swimming Pool and Enclosure PermitMinimum $100$10.00 per $1,000 of construction valueMinimum $100$10.00 per $1,000 of construction value Temporary Tent PermitMinimum $100$10.00 per $1,000.00 construction valueMinimum $100$10.00 per $1,000.00 construction value Permanent Sign PermitMinimum $100$10.00 per $1,000.00 construction valueMinimum $100$10.00 per $1,000.00 construction value Change of Use Permit - No Construction250250 Condition PermitMinimum $25025% of the Building Permit FeeMinimum $25025% of the Building Permit Fee Deferral of Permit Revocation100100 Transfer of Permit100100 Surcharge of Building without a PermitMinimum $150 30% of Building Permit FeeMinimum $150 30% of Building Permit Fee House 'Model' Change on Lot (post plan review letter)55% of the Building Permit Fee for New Model55% of the Building Permit Fee for New Model Sign Minor Variance250500 Alternative Solution Proposal ApplicationMinimum $100Minimum $100 Per Hour Review Time$100 per hour$100 per hour Written Request for By-Law and/or Work Orders5050 Other Fees *New - Search and ProcessingFirst Hour is free. $50/hour after the first hour (search, review, and processing time) *New - Electronic Data Sharing Minimum $20 service fee, includes up to 10 pages, $1 per additional page * New - Liquor Licence Approval121 Inspection Fees Construction Stage Not Ready or Re-Inspection(after 2 inspections of the same stage of construction5050 Building Permit Refunds5050 Administrative Functions Performed80% of the Building Permit80% of the Building Permit Administrative and Zoning Functions Performed70% of the Building Permit70% of the Building Permit Administrative, Zoning and Plan Examination Functions Performed45% of the Building Permit45% of the Building Permit Permit Issued and No Filed Inspections35% of the Building Permit5% per Field Inspection35% of the Building Permit5% per Field Inspection * These fees can be applicable as the singular fee for a permit, or a fee in addition to other Building Permit fees, dependent on the scope of work for the project. Please note that:- Any building categories not specifically identified are subject to building permit fees calculated at the rate of $10.00 per every $1,000 of estimated construction value. For classes of permit not described in the fee schedule, a reasonable fee shall be applied by the Chief Building Official.- Square meter rates apply to the gross area of the associated scope of work for the building permit.- The finished basement rates apply to the square meters of the finished basement area.- If basements or garages are being converted into or finished as a dwelling unit, the Additional Dwelling rate applies.- The total permit fee will be the sum of all fees and charges from all categories that are applicable to the project. Community Services Description2025 Fee2026 Fee Arenas, - Ice RentalsHST Extra unless Otherwise Indicated Non-Prime Adult Weekday(6am-10am)101.5109.5 Non-Prime Minor Sports(6am-10am) Weekday83.586.75 School Board CourseWeekday (Non-Prime)27.7528.5 Non-Prime Adult Weekday(10am-4pm)129.5139.75 Non-Prime Minor SportsWeekday (10am-4pm)106110.25 Prime Time Adult Weeknights (4pm-11pm)Weekend (6am-11pm)200.75216.75 Minors Sports PrimeWeeknight 4-11pmWeekends 7am-11pm174.5181.5 Benefit Ex Games$544.25 Plus Expenses$609.50 Plus Expenses Arena Ball Hockey & Event RentalsHST extra unless otherwise indicated Floor Rental – AdultsPer hour98.25119.75 Floor Rental – Minor SportsPer hour7381.75 CAA Arena Day Rental (spectator events) Ice In – 1 day**$4,558.50Plus expenses$5,105.50 Plus Expenses CAA Arena Day Rental (spectator events) Ice Out – 1 day**$3,718.50Plus expenses$4,164.75 Plus Expenses CAA Arena Day Rental (spectator events)Ice Out 3 or more days **$2,872.75Plus expenses$3,217.50 Plus Expenses CAA Arena Day Rental (spectator events) Non-profit/Service Clubs Ice In – 1 day **$4,229.50Plus expenses$4,483.25 Plus Expenses CAA Arena Day Rental (spectator events) Non-profit/Service Clubs Ice Out – 1 day**$2,353.25Plus expenses$2,494.50 Plus Expenses CAA Arena Day Rental (spectator events) Non-profit/Service Clubs Ice Out 3 days or more **$1,849.75Plus expenses$1,960.75 Plus Expenses Bar Privileges (extra charge)335.5409.25 *** Last Minute Discount - 5 days notice up to 33% off, At the Community Services Department discretion*** Sponsored Skates - (ice rate + expenses)*** Stat Holidays - Rate plus 25%*** Summer Ice - July and August - Prime Time Rate All Day *New - Extra Fees HST extra unless otherwise indicated Stage700 Event Floor - Private3500 Event Floor - Non-profit/ Service Clubs3000 Removal of Glass - Private Full Glass3200 Quarter Glass1000 Removal of Glass - Non-Profit/ Services Clubs Full Glass3000 Quarter Glass800 Fork Lift (operator provided) per day - Private900 Fork Lift (operator provided) per day - Non-Profit/ Service Clubs750 Geni Boom per day - Private (Client to supply City with proof of certification)650 Geni Boom per day - Non-Profit/ Service Clubs (Client to supply City with proof of certification)500 Additional TV on wheels - Private100 Additional TV on wheels - Non-profit/ Service Clubs75 Jumbo Screen in CAA per day - Private Plug and Play1000 Jumbo Screen in CAA per day - Non-Profit/ Service Clubs Plug and Play850 Waste Charge (for events/ tournaments)350 Labour Charge per hour$45-$49 Labour Charge per hour - Stat Holidays/ After Hours Set Up$90-$98 Event Rentals - FDC, MacKay And Wally Dever HST extra unless otherwise indicated Floor RentalIce In – 1 day **3617.54051.5 Floor RentalIce Out – 1 day **3001.53361.75 Floor RentalIce Out – 3 days or more **2256.752527.5 Floor RentalNon Profit/Service ClubsIce In - 1 day **3423.753629.25 Floor RentalNon Profit/Service ClubsIce Out – 1 day **18551966.25 Floor RentalNon Profit/Service ClubsIce Out – 3 days or more **15371629.25 ** Day rate or 10% of the gross gate, whichever is greater + $0.50 cents per ticket surcharge (Director discretion permitted to determine day rate or 10% gross, depending on event).+ applicable expenses (covering the floor, boards, insurance, forklift, electrical, SOCAN, extra labour etc.) QSWC RentalsHST extra unless otherwise indicated Full Gym hourly rate, Prime Time94.5113.5 Full Gym hourly rate, Non-Prime Time79.2595 Half Gym hourly rate, Prime Time6679.25 Half Gym hourly rate, Non-Prime51.561.75 Gym Daily Rental **772.25926.75 Daily Rental with alcohol**996.51195.75 Fitness Studio – Hourly Rate50.2560.25 Workout Studio – Hourly Rate*6072 Gym /Fitness Rooms rental fees are plus applicable expenses. Staff Leader: $27.71, Fitness $37.41, Yoga $46.35 per hour, plus tax, depending on the activity. Rentals are not permitted to be in direct competition with our programs or leases. Fitness / Program AreasHST extra, unless otherwise indicated (no HST for children under 13 years) Preschool/Children/Youth Programs Hourly Rate (NO HST for under 13 years)6.757 Children/Youth Specialty Programs/ Workshops (i.e. Babysitting Course) Per course/session rate$46.50 - $121.50$48.00 - $126.00 Day Camps Daily Rate (NO HST)39.2541 Camp Extra Hours (AM OR PM) Per day & time rate5.255.5 Learn to Skate Group Programs Rate per 25-min. Class (NO HST)10.511.25 Learn to Skate Adult Programs Rate Per 45-min. class1617 Semi-Private Skate Lessons Rate per 25-min. class (NO HST for under 13 yrs)15.7516.75 Private Skate Lessons Rate per 25-min. class (NO HST for under 13 yrs)26.528 Power Skating Programs Hourly rate (NO HST for under 13 yrs.)$15.50 - $18.50$16.50 - $19.75 50+ Centre Annual Membership*10.511 *New - Adult Instructional Programs - Hourly Rate16.25 Adult Fitness Programs Hourly rate*99.5 Adult Fitness Programs 30-min. Rate*5.55.75 Adult Specialty Fitness Classes Hourly rate* 1010.5 Fitness Lunch Express Pass Per week*(2.5 x 30-min. Rate)13.7514.5 Older Adult Yoga Hourly rate*7.758.25 Personal Training (Private)$27.50 - $54.00$29.25 - $57.25 Personal Training (Semi-Private)$16.00 - $27.50$17.00 - $27.50 Workout Studio - Monthly Pass* Youth42.545 Adult6360 Recreational – Pay as you go*Community Programs: Open Gym, Swim, Skate or Workout Studio Child4.254.5 Adult5.255.5 Recreational – monthly pass*Community Programs: Open Gym, Swim, Skate or Workout Studio Child8572 Adult10388 Shinny/ Ticket Ice – Pay as you go*6.256.5 Adult Premium Sports – Pay as you go*Pickleball, Badminton, Basketball & Volleyball, etc. – Pay as you go 6.256.5 Adult Sports – Pay as you go*Pickleball, Badminton, Basketball & Volleyball, etc. Please note: Program Fees may contain ‘extra fees’ to cover materials, manuals, certification fees, etc. *Fees listed include HST Kinsmen PoolHST extra unless otherwise indicated Kinsmen Pool – Whole Pool Includes 2 lifeguards148.75160.75 Kinsmen Pool – Half PoolIncludes 2 lifeguards102110 Kinsmen – Whole Pool Minor SportsIncludes 1 lifeguard95.2599 Kinsmen – Half Pool Minor SportsIncludes 1 lifeguard53.555.75 Kinsmen – Per Lane Minor Sports (maximum 2 lanes) No lifeguard, shared pool only13.7514.25 Extra Lifeguard27.7528.75 Kinsmen – Per Lane (maximum 2 lanes)No lifeguard, shared pool only18.2519.75 Recreational Swims – Pay as you go(Includes HST) Child/ Youth4.254.5 Adult5.255.5 Recreational Swims – Kinsmen Summer Pass (includes HST) Child/ Youth (per month)42.545 Adult (per month)6360 Please note: All private pool rentals are for up to 30 people. Additional lifeguards may be required, depending on participant number, equipment requested, or rental details. All pool rental rates are hourly. Aquatic Programs (Kinsmen & Templeman)HST extra unless otherwise noted (No HST for children under 13 years) Learn to Swim Group LessonsRate per 30-min. to 1- hour Class (NO HST, except for adults)$10.50 - $14.50$11.25 - $15.25 Learn to Swim Semi-Private/Private (30-min.) (NO HST for under 13 yrs.)$15.50 - $26.50$16.50 - $28.00 Advanced Leadership Programs (full length program) Extra fees apply (exam fees and manuals/materials)$147.50 - $327.00$212.00 - $306.50 Aqua-Fitness (per class)11.2512 Aqua-Fit Session Pass (per week)27.530 Templeman Aquatic CentreHST extra unless otherwise indicated Main Pool – Prime Timeup to 30 people / Includes 2 lifeguards206222.5 Main Pool - Non-Prime Timeup to 30 people / Includes 2 lifeguards191.25206.5 Half Main Pool - Prime Time Includes 2 lifeguards132.75143.25 Half Main Pool - Non-Prime Time Includes 2 lifeguards118127.5 Lane Rentals – per hour 3 lanes maximum/No lifeguards/shared pool only18.2519.75 Therapy Pool/Preschool PoolPrime Time / Includes 2 lifeguards122.5132.25 Therapy Pool/Preschool PoolNon-Prime Time / Includes 2 lifeguards107.5116 Main Pool - Minor Sports Prime Time / Includes 1 lifeguard149155 Main Pool - Minor SportsNon-Prime Time / Includes 1 lifeguard121125.75 Half Main Pool - Minor SportsPrime Time / Includes 1 lifeguard80.2583.5 Half Main Pool - Minor SportNon-Prime Time / Includes 1 lifeguard66.569.25 Lane Rental – Minor Sports – hourlyNon-Prime / No lifeguards13.7514.25 Therapy Pool/Preschool PoolMinor Sports - Prime Time / Includes 1 guard98.5102.5 Therapy Pool/Preschool PoolMinor Sports - Non-Prime / Includes 1 lifeguard84.7588.25 Per Extra Lifeguard27.7528.75 Recreational Swims – Pay per use (HST inc.) Child/ Youth4.254.5 Adult5.255.5 Recreational Swims - Monthly Pass (HST Inc.) Child/ Youth42.545 Adult6360 Meeting RoomsHST extra unless otherwise included Training Room, Gym Meeting Room, Youth/Pool Room, Pro-shop Meeting Room 2 hour Maximum – Non Profit41.2545.25 2 hour Maximum – Private7084 Half Day– Non –Profit4 hour maximum61.7568 Half Day– Private4 hour maximum99118.75 Full Day – Non Profit87.7596.5 Full Day – Private130.75157 Fireplace Room & Minor Sports Meeting Room 2 hour Maximum – Non Profit49.554.5 2 hour Maximum – Private7488.75 Half Day– Non –Profit4 hour maximum92.5101.75 Half Day– Private4 hour maximum130.75157 Full Day – Non Profit142.75171.25 Full Day – Private239286.75 Multipurpose Room & McFarland Pub Hourly Rate Non-Profit41.2545.25 Hourly Rate Private68.7582.5 Half Day – Non-Profit(4 hours max)121133 Half Day – Private(4 hours max)200.75241 Full Day – Non-Profit215.5237 Full Day – Private393.25472 Kitchenette - Non-Profit (extra)31.534.75 Kitchenette – Private (extra)34.2541 Audio Visual Equipment - Private79.2595 50+ Centre - (Restricted Availability & Uses) 2 Hour Max - Non-Profit49.554.5 2 Hour Max - Private7488.75 Program Monitor (per hour) - if required27.7 Half Day - Non-Profit(4 hour max)92.5101.7 Half Day – Private(4 hour max)130.75157 Full Day – Non-Profit142.75157 Full Day – Private239286.75 Hall Rental (i.e. Parkdale Community Centre) Hourly Rate46.7553.75 Half Day(4 hour maximum)92.25106 Three Quarter (3/4) Day (6 hours max)156.75 Full Day (8 hours max)221.25254.5 Gerry Masterson - Main Hall Friday or Saturday Rental402.5491.25 Event with Alcohol536.75755 Sunday Rental201.25245.5 Monday to Thursday134.25163.75 Gerry Masterson - Multi Occasion Room Full Day(seminars/ workshops)100.75122.75 ½ Day (4 hours)(seminars/ workshops)67 6 hour (Parties/ showers)134.25163.75 Sports FieldsHST extra unless otherwise indicated Ball Diamonds “A” Field – Hourly Rate Adult 11.512.5 “A” Field – Hourly Rate Youth 8.759 “B” Field – Hourly RateAdult1010.75 “B” Field – Hourly RateYouth (up to 4 hours)7.57.75 Season Opener Grooming - per hour12.512.5 Lights Hourly – Extra Fee2.52.75 Field & Artificial Turf “A” Field – Hourly Rate Adult (*New - 2026 fee includes field lining/ maintenance)11.525 “A” Field – Hourly Rate Youth (*New - includes field lining/ maintenance)8.7521.5 “B” Field – Hourly RateAdult (*New - 2026 fee includes field lining/ maintenance)1023.25 “B” Field – Hourly RateYouth (*New - 2026 fee includes field lining/ maintenance)7.520.25 Lights Hourly – Extra Fee2.52.75 Cricket Field - Hourly Rate (*New - 2026 fee includes field lining/ maintenance)31.25 Tournaments/ Special Events(Fields, Track, Fishing, etc. - Per Complex plus applicable expenses - Field and Track Tournaments are subject to $62.50 Fee per day/field). One Day Tournament – Adult$321.25 or $122.50 day/field$347.00 or $132.25 Day/Field One Day Tournament – Minor$240.00 or $83.50 day/field$249.50 or $86.75 Day/Field Two Day Tournament – Adult$387.00 or $142.00 day/field$418.00 or $153.25 Day/Field Two Day Tournaments – Minor$300.50 or $111.50 day/field$312.50 or $116.00 Day/Field Three Day Tournament – Adult$419.00 or $155.75 day/field$452.50 or $168.25 Day/Field Three Day Tournament – Minor$332.00 or $111.50 day/field$345.25 or $116.00 Day/Field Lights Hourly – Extra Fee2.52.75 A Diamonds – Rotary Park, Field of Abilities, Tom Gavey, Al Kelleher, Legion Park B Diamonds – Thurlow Park, Parkdale #1 A Soccer Pitches – M.A. Sills Park, Zwick’s Park B Soccer Pitches – Thurlow Park, Riverside Park, Hillcrest Park**** Artificial Turf Field - 25% increase for Spring Rentals (before Victoria Day) and Fall Rentals (After September 30) due to extra demand and maintenance requirements.*** Sports FieldsHST extra unless otherwise indicated Track Adult - per hour11.512.5 Minor - per hour8.759 Meets - Private/ High Schools daily rate$661.75 plus expenses$714.75 plus expenses Meets - Elementary Schools daily rate$352.50 plus expenses$366.50 plus expenses Sports CourtsHST extra unless otherwise indicated *New - Pickleball Court - Adult - per hour12.5 Court - Minor - per hour9 One Day Tournament – Adult$347.00 - 4 courts $132.25 - 1 court One Day Tournament – Minor$249.50 - 4 courts $86.75 - 1 court Two Day Tournament – Adult$418.00 – 4 courts $153.25 – 1 court Two Day Tournaments – Minor$312.50 – 4 courts $116.00 – 1 court Three Day Tournament – Adult$452.50 – 4 courts $168.25 – 1 court Three Day Tournament – Minor$345.25 – 4 courts $116.00 – 1 court Glanmore National Historic SiteHST extra unless otherwise indicated Admission - includes HST Admission – Adults (25-64) 8.58.5 Admission – Seniors (65+) 77 Admission –Youth (13-24) 66 Admission - Children (5-12) 3.53.5 Admission (0-5), Members, Library PassFreeFree *New - CFOne CardFree Large Group Tour (minimum of 11) 5.55.5 Education Program (per student) 33 Membership - includes HST Individual Membership3030 Family Membership5050 Corporate Membership100100 Rentals/ Photography and Filming Sessions Photography Sessions (3hrs) weekend (during operating hours)366446.5 Photography Sessions (3hrs) weekday (during operating hours)244297.75 Photography Sessions (3hrs) weekday (during operating hours)Rental Breakfast Room/Lower Level (3hrs) weekday (during operating hours)305372 Rental Breakfast Room/Lower Level (3hrs) weekend (during operating hours)488595.25 Rental Breakfast Room/Lower Level (3hrs) weekend (during operating hours)Rental/ Photos – extra fee (outside of operating hours) per hr. - weekend91.5111.75 Rental/ Photos – extra fee (outside of operating hours) per hr. - weekday6174.5 Rental/Photos - extra fee for set up/take down day (per day)122148.75 Rental - use of kitchen –extra fee91.5111.75 Grounds only events (3hrs) evening/weekend366446.5 Grounds only event (3hrs) weekday305372 Grounds only – photos anytime6174.5 Filming Rates – per day filming Mon-Fri (8-4:30pm)36604465.25 Filming Rates – for site prep per day Mon-Fri (8-4:30pm)12201488.5 Filming Rates – (per hr. per staff member) staff support after 4:30pm weekday6174.5 Filming Rate – (per hr. per staff member) staff support weekends91.5111.75 Filming Rate – per hr. site clean up after filming6174.5 Toymaker Time Machine incl. HST Child 8+48.75 Adult73.25 Special Events (i.e. Halloween/ Christmas, Aglow Tours) - incl. HST Adult12.2515 Student/ Senior10.2512.75 Child89.75 Under 5FreeFree Evenings/ Weekend Group Tours (outside of operating hours) - incl. HST Regular Group Tour Admission (Minimum 11 people) per person plus flat rate (+HST on flat rate only)$8.00/per personPlus $91.50/ hour$9.75/per personPlus $111.75/ hour HarboursHST extra unless otherwise indicated Meyers Pier Seasonal Mooring per foot of Boat57.563.25 Victoria Park Seasonal Mooring per foot of Boat53.7559 Other Harbour Fees Monthly rate per foot of boat23.525.75 Personal Watercraft (seadoo/ jet ski) per foot of boat added to existing boat slip13.2514.5 Seasonal DockPersonal Watercraft847931.75 Power 15 amp$151.25/season$166.25/ season Power 30 amp$242.00/season$266.25/ season Power 50 amp or 30 amp x 2$363.00/season$399.25/season Pump outs $21.50/each$23.75 each Transient Dock – ServicedPer foot of boat22.25 Transient Pier Wall - UnservicedPer foot of boat1.51.75 Boat Ramps Daily$6.50 (including taxes)$7.25 (including taxes) plus applicable fees Seasonal Pass63.75$79.00 (including taxes) plus applicable fees Commercial Season(3 passes)116.5$145.00 (including taxes) plus applicable fees Parks FacilitiesHST Extra unless otherwise indicated Market Square & Bernice Parrott Stage ** Non Profit GroupsDaily Rate 67.573 Commercial or Private FunctionDaily Rate 116.75126.25 Commercial or Private Function – Charging AdmissionDaily Rate 575.75622 Parks Special Events ** Covered Sites – Daily Rate136.25147.25 Large Uncovered Site – Daily Rate 90.597.75 Small Uncovered Site – Daily Rate 6368 Lion’s Pavilion with Alcohol – Daily Rate 682.25737 Lion’s Pavilion Non-Profit – Daily Rate 136.25147.25 Lion’s Pavilion Private – Daily Rate 202.75218.75 Wedding Ceremony (4 hours) 136.25147.25 Wedding Pictures (2 hours) 6368 Wedding Reception 401.75434 Large Park Events (up 2000/day) - No Admission Daily Rate245264.5 Large Park Events (up 2000/day) – Admission Charged Daily Rate 942.251017.5 Tent Fee29.2531.5 Locates68.7574.25 ** Daily rate or 10% of the gross gate, whichever is greater + applicable expenses (electrical, fencing, SOCAN, insurance, security, paid duty alcohol, staging, Parks fees etc.)** *** If events are charging for parking, approval must be given by Council. All costs are subject to Parks Service Fees. AdvertisingHST extra unless otherwise indicated Arena Boards/Wall Boards/Wall DecalsPer item ($50.00 less for additional purchased)718876 In-Ice LogosPer ice logo ($100.00 less for additional logo)$684.50 - $1,342.00$835.00-$1,637.25 Digital TV LCD Per week$33.50/ week$40.75/week Framed Wall Posters Medium Size Per month$33.50/ week$40.75/month Framed Wall Posters/Digital TV LCDLarge Size frame each/Digital TV LCD Digital TV per month$67.00/ month$81.75/month Framed Wall Posters – Medium Size6 month prepaid contract($50.00 less for additional purchased)167.75204.75 Framed Wall Posters – Medium Size 12 month prepaid contract($50.00 less for additional purchased)335.5409.25 Framed Wall Posters – Large Size6 month prepaid contract($50.00 less for additional purchased)335.5409.25 Framed Wall Poster - Large Size 12 month prepaid contract($50.00 less for additional purchased)671818.5 Digital TV LCD Digital TV per 6 month prepaid contract362.25442 Digital TV LCD Digital TV per 12 month prepaid contract644.25786 Marquee Sign – 2 sided LED Video Boardper week QSWC80.598.25 Marquee Sign – 2 sided LED Video Boardper week Zwick’s33.537.5 Marquee Sign – 2 sided LED Video Boardper month268.5327.5 Marquee Sign – 2 sided LED Video Boardper year26843274.5 Zamboni Panels 402.5$500 - $602.00 Sport field Advertising$335.50 - $1,342.00$409.25 - $1,637.25 ### For Arena & Wall Boards, and In Ice Logos – choose from a variety of locations in FDC, Mackay and Wally Dever Arena ### For Digital TV - Appears a minimum of 4 times per/hour for 8 seconds on TV Screens (QSWC)### For Marquee Sign – Minimum ad/every 10mins, 6 ads every hour, 114 ads/day, 3420 ads/month or 1 – 10 second ad per week event and no charge for Zwicks marquee sign for event promotion if advertising event on the QSWC marquee sign*** Archives Scanned Images$5.25 per image (or by donation)$5.25 per image (or by donation) Black & White Copies$0.25 per page$0.25 per page Colour Prints$1.00 per page$1.00 per page Corporate Services Description2025 Fee2026 Fee RECORDS & LICENCES Commission of Oaths Services to City of Belleville residents$30 + $4 per page for multipage forms$30 + $4 per page for multipage forms Marriage License150160 Certified True Copies30 Burial Permits - Out of Town1530 Burial Permits - In Town1030 Photocopy ServiceFirst page $1, Each additional page $0.25First page $1, Each additional page $0.25 By-Law Enforcement Officer Appointment Request3550 Application for Fenceviewers250 Appeal of Fenceviewers’ Decision125N/A Municipal Information for Liquor Sales Licence2550 Liquor License Agency Letter of Approval2550 Records and Information SearchCost RecoveryCost Recovery Noise By-Law Exemption RequestApplication Fee - $75Permit Fee - $150250 Freedom of Information Request (FOI)5 Freedom of Information Request5As per MFIPPA FOI ApplicationAdditional charges may apply. Additional charges may apply. You will be provided with a fee estimate where charges are estimated to be more than $25. If the estimate exceeds $100, a 50% deposit will be required before the request can be processed.As per MFIPPA GIS Mapping Fees5 Hard Copy (Materials)55 Custom Colour Mapping (96” wide plot)9090 Custom Black & White (96” wide plot)7070 Custom Colour Mapping (36” wide plot)2020 Custom Black & White (36” wide plot)1515 Custom Colour Mapping (24” wide plot)1515 Custom Black & White (24” wide plot)1010 Custom Colour (8 ½” x 11” up to 11” x 17”)55 * Labour Charge5050 *Labour charges include creation of map images, spreadsheets, database, and/or tables, and would also include analysis, queries, data transformation and file transfer Digital Data (SHP or DWG format in NAD 83) Parcel mappingIncludes property line work and a single attributable field (assessment roll number – no other property information will be available to the public)$2/parcel$2/parcel Municipal Land Inquiry Application Stop Up and Closure of Road Allowance, Laneways and Alleyways$300 Application Fee (non-refundable) and $2,500 deposit$300 Application Fee (non-refundable) and $2,500 deposit Municipal Land Inquiry Application• Municipal Land Purchase• Easement Inquiry• Lease/ Licence Inquiry• Road Allowance• Encroachment Inquiry• Ownership Inquiry135135 Market Dues Annual: January to December9x12 with Parking150200 Annual: January to December9 x 12 No Parking (limited)115150 Daily (to a maximum of $150)9x12 with Parking2525 Daily (to a maximum of $150)9 x 12 no Parking$25$25 Vehicles for Hire License Fees Taxi Cab Owner125125 Taxi Cab Driver8585 Broker600600 Wheelchair Accessible Taxicab OwnerNo ChargeNo Charge Replacement of taxicab driver photo identification card2020 Transfer of Plate1010 Replacement Plate3535 Limousine Owner125125 Limousine Driver8585 Transportation Network Company – 1 – 24 vehicles16001600 Transportation Network Company – 25 – 50 vehicles32003200 Transportation Network Company – 51 - 100 vehicles55005500 Transportation Network Company – 101+ vehicles$50/ vehicle$50/ vehicle Taxicabs may be rented by one passenger or passengers traveling as one group at an hourly rate for a minimum period of one hour Short Term Accommodations Short-Term Accommodation Fee$1,000 new application1000 Annual Renewal300500 Owner-Occupied Short-Term Accom500 Annual Renewal - Owner-Occupied250 Parking Parking Meter$1/ hour$1.50/ hour Parking Lots - Meters Effective Monday to Friday, inclusive exemptions for Saturday, Sunday, and Statutory Holidays$1/ hour$1.50/hour Parking Lots - Permits$65/ month$95/month Daily Permit – Due to the occupation of a spot for a period of time longer than which a vehicle is authorized to do so, and prevents the use or the safe use of any metered parking space$9/ day$12/ day Business Licences Schedule A – Auctioneers Resident$150 annual$150 annual Non-Resident$250 annual$250 annual Schedule B – Barber/Hair/Beauty Salon$25 annual$50 annual Schedule C – Driving School/Driving Instructor$75 annual$125 annual Business Licences - Schedule D – Hawker/Pedlar Class \"A\"$500 per day$500 per day Class \"B\"$25 per day$30 per day Class \"C\" - per license per event where the sale is comprised of less than 25 vendor$200 per licence$300 per licence Class \"C\" - per license per event where the sale is comprised of 25 vendors or more$500 per licence$600 per licence Class \"D\" (5 day maximum)$50 per licence$50 per licence Schedule E – Bed and Breakfast/Lodging House $150 annual Schedule F – Plumbers Schedule G - Public Garage$50 annual$75 annual Business Licences - Schedule H - Public Hall Seating capacity under 200 persons$50 annual$50 annual Seating capacity is between 200 and 300 persons$75 annual$75 annual Seating capacity is more than 300 persons$125 annual$125 annual Business Licences - Schedule I - Refreshment Places Schedule I – Refreshment Place/Victualling House$75 annual$150 annual Business Licences - Schedule J - Refreshment Vehicles Class \"A\", \"B\", \"C\"$200 per licence, +$100 per each additional vehicle$300 per licence, +$100 per each additional vehicle Class \"D\"$150 per licence, +$50 per each additional vehicle$200 per licence, +$100 per each additional vehicle Class \"E\"$500 annual$500 annual Schedule J - Refreshment Vehicle Schedule K – Second Hand Dealer• New Application• Renewal Application$500 annual$150 annual$500 annual$150 annual Schedule L - Flea Markets Operator - New Application$500 annual$500 annual Operator - Renewal Application$150 annual$150 annual Vendor - New Application$25 annual$25 annual Vendor - Renewal Application$25 annual$25 annual Schedule L - Tanning Facility New Application$50 annual$50 annual Renewal Application$25 annual$25 annual Property Standards and By-Law Portable Sign PermitMaximum $50 per month or $15 per week or part thereofMaximum $80 per month or $20 per week or part thereof Poster Panel Sign Permit$25 per $1,000 of construction value to a maximum of $100$25 per $1,000 of construction value to a maximum of $100 Removal and Impound (signs placed on municipal property$50 per sign$50 per sign Administrative Fee for Remediation150200 Non-Compliance Re-Inspection Fee50$100 per inspection ** Fees are applicable to Work Orders issued as per \"The Maintenance of Land in a Clean and Clear condition 2014-120\" and/or 'Property Standards By-Law No. 2012-79\". Donation Program - Parks Description2025 Fee2026 Fee Memory Lane Stone/ CN Monument215215 Tree including Memory Stone800800 Park Benches40004000 Picnic Tables with Plaque16001600 Economic Development Description2025 Fee2026 Fee Pop-Ups on the Bay Businesses that are in operation under 3 years, seasonal businesses, retail and experience/activity operators May – September: $1,980May – September: $1,980 Existing businesses that have been in business three (3) years or more, that are seeking a secondary seasonal location to support expansion efforts and food trucksMay –September: $3,400May –September: $3,400 Holiday Huts units for businesses that do not require or require limited utilities and are placed in new locations between the waterfront and downtownMay –September $1,000May –September $1,000 Weekly rates may be available for hydro only units$200 per week$200 per week Weekly rates for food trucks may be available$375 per week$375 per week Temporary Outdoor Patio Permit Fees Micro$540/ year$540/ year Medial$660/ year$660/ year Macro$780/ year$780/ year Engineering Description2025 Fee2026 Fee Encroachment Agreement185185 Road Allowance Installation Consents415415 Engineering Records Search and ReviewFirst hour - no charge: $50 per hour after first hourFirst hour - no charge: $50 per hour after first hour Digital Information on Compact Disc$20 per USB$20 per USB Engineering Drawings - an size$10 per print$10 per print Peer ReviewMinimum $1,050. If assistance from an expert or professional is required to evaluate, review or report on an application, then the applicant is responsible for all costs.Minimum $1,050. If assistance from an expert or professional is required to evaluate, review or report on an application, then the applicant is responsible for all costs. Environmental Services Description2025 Fee2026 Fee Bag Tags33 Pick up and disposal of white goods Freon Items5050 Non Freon Items4040 Pick up and disposal of bulky goods Small Items:- TV's, TV stands, bundles of wood, end tables, hampers, kitchen chairs, small rugs ( this list is not all inclusive)2020 Large Items:- Non small Good Exemptions: Society of St. Vincent de Paul, 205 Coleman Street & The Salvation Army, 295 Pinnacle Street, and 99 Parks Drive2525 Residents of Thurlow Ward Taken to Thurlow Landfill Site Tipping Fees: Utility Trailer, car, ½ ton (level) truck3030 Single axle dump truck100100 Tandem dump truck150150 Tipping Fees - Large Items: Appliances, televisions, chesterfields, chairs, microwaves, toilets, sinks and bathtubs2020 Galvanized cold water tank2020 Hot water tank2020 An additional $35.00 surcharge will apply when items contain freon, i.e. refrigerators, freezers, air conditioners, and have not been tagged by a certified person to be empty of refrigerant. Shingle disposal, box spring and mattress, passenger tires, truck tires, tractor tires and tire tubes are no longer permitted Finance Description2025 Fee2026 Fee Tax Certificate5555 Returned Payment4040 Late Payment Penalty/ Interest 1.25% monthly1.25% monthly Account History/ Statement of Account - Property TaxesAccount History/ Statement of Account - Water$30 per year$10 per year$30 per year$10 per year Tax Receipts1616 Duplicate Bill Notice (Tax Bill, Water Bills, Reminder/Overdue Notice, Collection Notice)2020 Change of Ownership - Property TaxesChange of Occupancy/ New Account - Water Bill3030 New Account5050 Transfer to Taxes - per transaction2020 Payment Transfer (wrong account number)3030 Refund/ Overpayment recovery (Tax Bill or Water Bill)3535 Title Search - Property in second year arrears5555 Overdue Notices55 Credit Card Service Fees:Where the City has entered into an Agreement with a third party service provider to accept credit card payments for Property Taxes, Water and Sewer, Accounts Receivable invoices and Planning Fees on the City’s behalf, the fees associated with the transactions and charges are authorized under this by-law. Multiple Property Billing List$3 per roll number$3 per roll number Post Date Cheque Return1515 Corporate Search Recovery Charge2525 Tax Sale CostsActual Recoverable CostActual Recoverable Cost Fire & Emergency Services Description2025 Fee2026 Fee Liquor License Inspection & Signing Authorization171171 Business License Inspection Fee8686 Reproduction of Existing Documents7575 Letter of Compliance7575 File Search7575 Fire Safety PresentationNo ChargeNo Charge Fire Investigation ReportInformation/ Insurance (Solicitor) and Owners (Letter)7575 Fire Extinguisher Training$100/hour, minimum 2 hour session$100/hour, minimum 2 hour session Home Daycare More than 5 children171171 Private Day Care - 5 children or less8686 Day Care Centre - Annual Renewal (located in schools)8686 Legalized Marijuana Grow Ops (2,000 ft2)257257 Each additional 2,000 ft2)8686 Preventable False Alarm (By-law 2010-40 under review) (2nd) in 12 monthsSet by MTO rate (3rd and subsequent alarms) in 12 months (2nd) in 12 monthsSet by MTO rate (3rd and subsequent alarms) in 12 months Fire Safety Plan review after Initial Review8686 Vulnerable Occupancy 2nd and subsequent fire drill8686 Foster Care and Group Homes171171 Boarding, Lodging, Bed & Breakfast171171 Two-Unit Residential171171 Part 9 Buildings – except single family dwelling and two-unit Residential$175 minimum or $75 per hour$175 minimum or $75 per hour Single Family Dwelling8686 Part 3 Building$225 minimum or $75 per hour$225 minimum or $75 per hour 2nd and subsequent Property Re-inspection8686 Recycling or other outdoor premisesBill according to building classification and sizeBill according to building classification and size Display Fireworks Approval (per venue)171171 Consumer Fireworks Sales Permit (per permit)171171 Fireworks By-Law Violation Rate set by MTO per apparatusRate set by MTO per apparatus Emergency Response Vehicle Fires (Non-residents)600600 Natural Gas Incidents485485 Open Air Burning Permit Violations485Rate set by MTO Change Vehicles Fires (non-residents and attending natural gas incidents to the following) Hazardous Materials per apparatus per hourRate set by MTORate set by MTO Replacement of equipment/ resources at 100% overtime personnel/ resources at overtime rateRate set by MTORate set by MTO Vehicular Suppression/ Rescue – Highway 401 (King and Queen Highways)Rate set by MTORate set by MTO All other roads (Non-residents)Rate set by MTORate set by MTO Scene SecurityVaries based on contracted servicesVaries based on contracted services Boarding of BuildingVaries based on contracted servicesVaries based on contracted services Heavy Equipment Rental – Fire InvestigationVaries based on contracted servicesVaries based on contracted services Open Air Burn Permit (Annual Fee)2525 Open Air Burning for Agricultural125125 Open Air Burning Violation or nuisances call – 1st response in calendar yearRate set by MTORate set by MTO Open Air Burning Violation or nuisances call – 2nd response in calendar yearRate set by MTORate set by MTO Open Air Burning Violation or nuisances call – 3rd response in calendar yearRate set by MTORate set by MTO Failure to obtain an Open Air Burning PermitRate set by MTORate set by MTO False Alarms First false alarm within fiscal yearNo ChargeNo Charge Second false alarm within fiscal yearNo ChargeNo Charge Each subsequent false alarm within fiscal yearRate set by MTO per vehicle respondingRate set by MTO per vehicle responding Standby/ Fire Watch - HourlyRate set by MTO per vehicle respondingRate set by MTO per vehicle responding Planning Description2025 Fee2026 Fee Application for Official Plan Amendment Involving any proposed expansion to the Urban BoundaryRegular fee and subject to a Cost Recovery Agreement with the City Commercial Use where the lot area is greater than 4,000 m290509510 Residential Use in excess of 25 dwelling units90509510 Other67807120 Application renewal fee, due at each anniversary of the application date until approved or withdrawn (1-year grace period on applications in progress as of December 31, 2025) 50% of the applicable fee for a new application * Required fees are doubled for after-the-fact applications Application for Zoning By-Law Amendment Commercial Use where the lot area is greater than 4,000 m266807020 Residential Use in excess of 25 dwelling units66807020 Other56005880 Other - Minor (lot area less than 1,000 m2 or may be applied to condition of consent)30803240 Application renewal fee, due at each anniversary of the application date until approved or withdrawn (1-year grace period on applications in progress as of December 31, 2025) 50% of the applicable fee for a new application * Required fees are doubled for after-the-fact applications Combined Applications for Official Plan and Zoning By-Law Amendment Involving any proposed expansion to the Urban BoundaryRegular fee and subject to a Cost Recovery Agreement with the City Commercial Use where the lot area is greater than 4,000 m21432015040 Residential Use in excess of 25 dwelling units1432015040 Other1158012160 Application renewal fee, due at each anniversary of the application date until approved or withdrawn (1-year grace period on applications in progress as of December 31, 2025) 50% of the applicable fee for a new application Temporary Use By-Law36703860 Cost of sign to Notify Public of Applications listed above$250 + $150 per extra sign$265 + 160.00 per extra sign Removal of Holding (H) Symbol14001470 Review of an application for a Minister’s Zoning Order (MZO)The same fee as otherwise payable for a combined Official Plan and Zoning By-law Amendment * Required fees are doubled for after-the-fact applications Application for Site Plan Approval Residential Use53905660 Commercial or Institutional Use53905660 Industrial or Other Use53905660 All additions 20 m2 to 70 m2 gross floor area29103060 All additions less than 20 m2 gross floor areaNILNIL * Required fees are doubled for after-the-fact applications Other Site Plan Approval Fees Application Revision Requiring Engineering Review24302560 Amending Agreement for Phased Site Plan14501530 Application for Site Plan Undertaking19902090 * Required fees are doubled for after-the-fact applications Application for Draft Plan of Subdivision/Condominium Application for Draft Plan of Subdivision/Condominiums$6,370 + $105 per lot/ unit$6,690 + $120 per lot/ unit Application for Condominium Exemption53905660 Application for Condominium Conversion$5,180 + $520 per lot/ unit$5,440 + $550 per lot/ unit Request to Extend Draft Plan Approval27002840 Request to Redline Draft Plan Subdivision Minor - No Circulation16201710 Major - Circulation Required27502890 Subdivision/ Condominium Agreement69007250 Application for Final Approval28002940 Deeming By-Law22602380 Pre-Servicing Agreement28603010 Model Home Agreement18401940 * Required fees are doubled for after-the-fact applications Application to the Committee of Adjustment Application for Consent to create new lot (per lot)27002840 Application for Validation of Title13501420 Application for all other types of consents (e.g. lot addition, easement, right-of-way)15201600 Application for Minor Variance affecting 3 or more lots/blocks in a draft or registered plan of subdivision30003150 Application for Minor Variance where there is a concurrent or associated Zoning By-Law Amendment within the past 2 years750750 Application for Minor Variance or Permission, other12501320 Combined Applications for Consent (new lot) and Minor Variance34503630 Combined Applications for Consent (no new lot) and Minor Variance22702390 Request for revisions to conditions of consent590620 Separate consent certificate for retained lands, or reissue of consent certificate375400 Re-application for consent, which conditions lapsed less than one (1) year9751030 * Required fees are doubled for after-the-fact applications Cash-in-Lieu Parkland One unit dwelling lots80808490 Other residential development5% of the property value5% of the property value Non-Residential development2% of the property value2% of the property value Other Fees Zoning & Business Compliance Letters (zoning certificates, letters for car dealers and liquor licenses)270290 Initial Pre-Consultation, not involving the Development Review Team (which may be contributed towards application fees)5% of the proposed application fees to a maximum of $570 Pre-Consultation which are subsequent or with the Development Review Team (which may be contribute towards an application fee)540570 Telecommunications Towers & Antennas Application22602380 Cash-in-Lieu of Parking $4,300 per parking space$4,420 per parking space Application for a Part Lot Control By-Law, per block53855650 Paper Copy of the Official Plan150160 Paper Copy of Zoning By-Law150160 Additional public meeting, advertising or other City costs arising from revision by Applicant to planning application already being processed860910 Inactive Application Renewal (excluding Zoning By-law and Official Plan amendment applications)760800 * Required fees are doubled for after-the-fact applications TOS Description2025 Fee2026 Fee Road Occupancy Permits200200 Road Cut Permits400400 Entrance Permit200400 Sidewalk Reconstruction (*New - minimum charge of 2m2)$225/m2$225/m2 Asphalt Pavement Reinstatement90 mm (3 ½ inch)(Also used for Surface Treated Roads) - Greater than 3m2 (*New - minimum charge of 2m2)Greater than 3 m2 - 165/m2Greater than 3 m2 - 165/m2 Asphalt Pavement Reinstatement90 mm (3 ½ inch)(Also used for Surface Treated Roads) - Less than 3m2Less than 3 m2 - $225/m2Less than 3 m2 - $225/m2 Asphalt Pavement Reinstatement(Full Depth and Deep Strength)Cost + Administration FeeCost + Administration Fee Curb & Gutter Reconstruction (*New - minimum charge of 2m2)$225/m2$225/m2 Curb Reconstruction (*New - minimum charge of 2m2)$225/m2$225/m2 Supply & Installation of 300 mm(12 inch) Diameter Driveway CulvertGravel Driveway$450/m2$450/m2 Supply & Installation of 375 mm(15 inch) Diameter Driveway Culvert Gravel Driveway$475/m2$475/m2 Supply & Installation of 450 mm(18 inch) Diameter Driveway CulvertGravel Driveway$500/m2$500/m2 Supply & Installation of 750 mmDiameter Driveway CulvertGravel Driveway$600/m2$600/m2 Install Entrance – no pipe25002500 Relocate Culvert25002500 Work without a permit in road allowanceDouble Road Cut Permit Fee + 50% SurchargeDouble Road Cut Permit Fee + 50% Surcharge Winter Work50% Surcharge50% Surcharge Parks Access Permit + Deposit Permit $100Deposit $500 (Refundable)Permit $100Deposit $500 (Refundable) Wide Load Fees Annual Permit300300 Seasonal Permit200200 Single Trip Permit7575 Transit Description2025 Fee2026 Fee Adult Cash3.254 Mobile Ticket3.254 Monthly Pass8090 Concession Fare (Eligibility: Seniors, Children Under 12, those with a disability) Cash3.253.75 Mobile Ticket33.75 Monthly Pass7585 Regional Transit Pass Adult (Belleville & Prince Edward County)230 Concession (Belleville & Prince Edward County)180 Reloadable Fare Card55 Advertising Bus Exteriors• Size: 21” x 70” 60 PT Polystyrene• Location: Lower Rear400400 Vinyl's • Self-adhesive vinyl is placed on the sides of the buses as buses are not equipped with aluminum frames:Printing, Installation & Removal is additional to the following prices. Prices below are for the ad space only, design, printing, installation and removal of the vinyl is quoted separately based on the project.Installation & Removal: Paid by the advertiser, agency or production house. Rear Window 24” x 55”400400 Size: Side Vinyl 30” x 139” 3M Controlac500500 Full One Side Bus Wrap800800 Rear of Bus Wrap650650 Full Complete Bus Wrap20002000 Above amounts do not include production & install Bus Interiors 20 pt Polystyrene$10 per month per signOr $100 per month for 11 Spaces$10 per month per signOr $100 per month for 11 Spaces 11” x 17” $10 per month per signOr $100 per month for 11 Spaces$10 per month per signOr $100 per month for 11 Spaces 11” x 35” Pt Polystyrene$10 per month per signOr $100 per month for 11 Spaces$10 per month per signOr $100 per month for 11 Spaces Shelter Aluminum Framed Ad Boxes 47 ¼” x 68 1/2” 20 PT Polystyrene$250 per spot - Plus production & install$250 per spot - Plus production & install Sidney Street & Bridge Street West47 ¼” x 68 1/2” 20 PT Polystyrene$290 per spot - Plus production and install$290 per spot - Plus production and install Onboard Video 10 second continuous message175175 Production and Installation (one –time rate) Bus Exteriors21” x 70” 60 Pt Polystyrene Location: Lower Rear220220 Bus Interiors11” x 17” 20 Pt Polystyrene1818 11” x 35” 20 Pt Polystyrene2525 Shelter Aluminum Framed Ad Boxes155155 Onboard Video10 Second continuous message175175 Note: HST is additional for all Advertising charges Water Description2025 Fee2026 Fee Metered First 455 cubic Metres2.022.06 Next 22,275 cubic metres1.541.57 Over 22,730 cubic metres0.920.94 Bulk33 MONTHLY FIXED CHARGES 2025 FEE2026 FEE Meter SizeServiceService 5/826.8527.29 3/426.8527.29 129.5430.02 1 1/242.9643.66 256.3957.31 383.2484.6 4152.78155.28 6255.08259.26 8362.48368.42 10483.57491.49 *New - 12589.74 MONTHLY FLAT RATE WATER CHARGES (SERVICE NOT METERED) 2025 FEE2026 FEE City of Belleville48.651.03 Point Anne123.91130.11 QUARTERLY WATER BUILDING CHARGES Single to 5 Units133.92136.1 6 Units to 12 Units264.38268.69 13 Units to 26 units528.74537.36 Over 26 Units1057.531074.77 OTHER CHARGES - WATER RATES Collection Charge2530 Reconnection Charge - regular business hours4550 Seasonal Disconnection & Reconnection9090 Change of Occupancy30 Late Payment Penalty/ Interest (Monthly)0.010.01 Form 1 Water Approval25002500 Form 1 Sanitary Approval25002500 Form 1 Storm water Approval25002500 Fire Hydrant Flow Test200200 Quench Buggy Rental (per day)200200 (per consecutive day after first day)100100 LOCATE SERVICES, LEAK DETECTION & HYDRANT MAINTENANCE Belleville General Service$100/ hour$100/ hour Outside Belleville$200/ hour$200/ hour SERVICE TAP (per service) 3/4\" and 1\" Service200200 1 1/2\" and 2\" Service400400 4\", 6\", 8\" Service800800 Outside Belleville, applicable rate plus per hour travel rate100100 REPLACE DAMAGED METER 5/8\" to 1\"300300 Over 1\"Time and MaterialTime and Material CUSTOMER DEPOSITS Residential260270 General Servicebased on estimated bill for 3 billing periodsbased on estimated bill for 3 billing periods Bulk Water Key Deposit125125 Surcharge as a % of Water charge applied to water Consumption, Service and Flat Rate Charges Residential1.041.12 General Service First 22,730 cubic metres1.041.12 Over 22,730 cubic metres0.60.6 OTHER CHARGES Septage Haulers, per 4,546 litres plus sample costs175175 SEWER RODDING, PER SERVICE During regular business hours235235 After hours, including weekends475475 Get In Touch Stay up-to-date Subscribe to this page to get notified when this page has updated content. Notify Me Close Search Pop Up Search I Want To... Close I Want To menu Search Close Old Browser Notification Browser Compatibility Notification It appears you are trying to access this site using an outdated browser. As a result, parts of the site may not function properly for you. We recommend updating your browser to its most recent version at your earliest convenience."
  },
  {
    "municipality": "Belleville, City of",
    "source_type": "other",
    "title": "Plans, Studies and Reports\n        - City of Belleville",
    "date": null,
    "source_url": "http://www.belleville.ca/en/city-hall/city-hall-plans-studies-and-reports.aspx",
    "text": "Close Alert Banner Plans Studies and Reports Decrease text size Default text size Increase text size Print This Page Share This Page Facebook Twitter LinkedIn Email Menu Accessibility Plan Asset Management Plan Budget and Financial Reports Building Services Reports Business Retention and Expansion Development Charges Economic Development Strategic Plan Environmental Services Reports Energy Reporting and Planning Fire Master Plan Infrastructure Phasing Strategy Official Plan and Zoning Strategic Plan Strategic Asset Management Policy Transportation Master Plan 2025 City of Belleville Wastewater Financial Plan 2025 City of Belleville Water Financial Plan Get In Touch Stay up-to-date Subscribe to this page to get notified when this page has updated content. Notify Me Close Search Pop Up Search I Want To... Close I Want To menu Search Close Old Browser Notification Browser Compatibility Notification It appears you are trying to access this site using an outdated browser. As a result, parts of the site may not function properly for you. We recommend updating your browser to its most recent version at your earliest convenience."
  },
  {
    "municipality": "Belleville, City of",
    "source_type": "other",
    "title": "Plans, Studies and Reports\n        - City of Belleville",
    "date": null,
    "source_url": "http://www.belleville.ca/en/city-hall/city-hall-plans-studies-and-reports.aspx?_mid_=41338",
    "text": "Close Alert Banner Plans Studies and Reports Decrease text size Default text size Increase text size Print This Page Share This Page Facebook Twitter LinkedIn Email Menu Accessibility Plan Asset Management Plan Budget and Financial Reports Building Services Reports Business Retention and Expansion Development Charges Economic Development Strategic Plan Environmental Services Reports Energy Reporting and Planning Fire Master Plan Infrastructure Phasing Strategy Official Plan and Zoning Strategic Plan Strategic Asset Management Policy Transportation Master Plan 2025 City of Belleville Wastewater Financial Plan 2025 City of Belleville Water Financial Plan Get In Touch Stay up-to-date Subscribe to this page to get notified when this page has updated content. Notify Me Close Search Pop Up Search I Want To... Close I Want To menu Search Close Old Browser Notification Browser Compatibility Notification It appears you are trying to access this site using an outdated browser. As a result, parts of the site may not function properly for you. We recommend updating your browser to its most recent version at your earliest convenience."
  },
  {
    "municipality": "Belleville, City of",
    "source_type": "other",
    "title": "Applications, Licences and Permits\n        - City of Belleville",
    "date": null,
    "source_url": "http://www.belleville.ca/en/city-hall/applications-licences-and-permits.aspx",
    "text": "Close Alert Banner Applications, Licences and Permits Decrease text size Default text size Increase text size Print This Page Share This Page Facebook Twitter LinkedIn Email Menu Available Applications, Licences, and Permits 911 Application Building Permits Burn Permits Business and Taxi Licences Community Improvement Plan Applications Consent/Severance Applications Dog Tags Encroachment Application Grants Insurance Claims Lottery Licences Marriage Licences Minor Variance Application Oaths and Affidavits Official Plan Amendment Application Plan of Subdivision / Plan of Condominium Application Road Permits Site Plan Application Telecommunication Tower Application Zoning By-law Amendment Application Water and Sanitary – New Accounts Commercial Service Contract - Owner Commercial Service Contract - Tenant Online Application for New Accounts - Owner Online Application for New Accounts - Tenant Close Account New Water and Sanitary Service Installations Have Your Property Serviced Extension of Municipal Services Get In Touch Stay up-to-date Subscribe to this page to get notified when this page has updated content. Notify Me Close Search Pop Up Search I Want To... Close I Want To menu Search Close Old Browser Notification Browser Compatibility Notification It appears you are trying to access this site using an outdated browser. As a result, parts of the site may not function properly for you. We recommend updating your browser to its most recent version at your earliest convenience."
  },
  {
    "municipality": "Belleville, City of",
    "source_type": "council",
    "title": "Budget and Financial Reports\n        - City of Belleville",
    "date": null,
    "source_url": "http://www.belleville.ca/en/city-hall/budget-and-financial-reports.aspx?_mid_=117458",
    "text": "Close Alert Banner Budget and Financial Reports Decrease text size Default text size Increase text size Print This Page Share This Page Facebook Twitter LinkedIn Email Menu Budget The annual budget is an important policy document that dictates how the City will collect and allocate resources to best improve and maintain City services and infrastructure for the community. The budget is broken down into two components: the Capital Budget and the Operating Budget. Key Performance IndicatorDiscover the City’s regularly reported performance indicators.2026 Budget & PlansGet involved in the development and review of draft budgets and plans.Stay Informed!Sign-up for updates regarding the City’s Budget.Capital Budget 101Learn the basics of operational spending at the CityOperating Budget 101Learn the basics of capital spending at the City. 2025 Property Tax CalculatorDiscover what services your taxes pay for. 2026 Budget The draft 2026 Capital Budget and 10-Year Capital Plan were approved at the Nov. 18, 2025 Special Council Meeting. 2026 Capital Budget & 10-Year Capital Plan Summary 2026 Capital Budget - As approved November 18 10-Year Capital Plan - As approved November 18 Nov. 18 Capital Budget Special Council Meeting Agenda Nov. 18 Capital Budget Special Council Meeting Recording 2026 Capital Budget & 10-Year Capital Plan Survey Results Report Nov. 18 Capital Budget and 10-Year Capital Plan Presentation Oct. 27 Budget Overview Council Presentation 2026 Preliminary Budget Survey Results Report 10-Year Capital Plan Map: Explore the projects in the 10-year plan in our interactive map. Key Performance Indicator (KPI) Dashboard: Check out the City’s performance as it relates to its assets, finances and general operations. If an alternate format is required for any of the documentation found on this webpage please email budget@belleville.ca or call 613-968-6481. 2025 Budget The City’s budget was finalized at the Feb. 20, 2025 Special Council Meeting, resulting in the following residential tax rate increases from 2024 by Tax Billing Table: Belleville Urban - 4.25% Cannifton Urban - 4.42% Cannifton Rural - 5.11% Belleville Rural - 5.35% Cannifton Rural to Urban - 6.27% This budget incorporated service and boundary changes as identified in the 2024 Fire Master Plan. 2025 Operating Budget Special Council Agenda and Recording - February 20, 2025 2025 Operating Budget - as Adopted 2025 Departmental Plans 2025 Operating Survey Results Report 2025 Operating Project Progress Report 2025 Capital Budget and 10-Year Capital Plan Special Council Agenda and Recording – November 18, 2024 2025 Capital Budget - as Adopted 10-Year Capital Plan 2025 Capital Budget & 10-Year Capital Plan Phase 2: Public Engagement Results 2025 Operating Project Progress Report Historical Budgets The City’s historical Capital and Operating Budgets below may include amendments made throughout the year in accordance with the City’s Budget & Financial Controls Policy. 2024 2024 Capital Budget 2024 Capital Budget as Adopted - December 6, 2024 2024 Capital Budget as Amended - January 16, 2025 Capital Budget Presentation Recording – December 6, 2023 2024 Capital Budget Phase 1: Public Engagement Report 2024 Capital Budget Phase 2: Public Engagement Report Request a copy of the 2024 Capital Budget Material Capital Projects Progress Report The Capital Projects Progress Report is reported to the City’s Finance Committee bi-monthly 2024 Operating Budget 2024 Operating Budget Presentation (as proposed) Recordings: Part 1 - February 27, 2024 Part 2 – February 27, 2024 2024 Operating Budget – Final Survey Results 2024 Operating Budget – Preliminary Survey Results 2024 Operating Budget - Taxation (Adopted March 12, 2024) 2024 Tax Impact Schedule (Adopted March 12, 2024) 2024 Operating Budget - Parking (Adopted March 12, 2024) 2024 Operating Budget - Water (Adopted March 12, 2024) 2024 Operating Budget - Wastewater (Adopted March 12, 2024) 2024 Operating Budget - Tax Distribution by Billing Table 2024 Departmental Plans Request a copy of the 2024 Operating Budget Material Operating Projects Progress Report The Operating Projects Progress Report is reported to the City’s Finance Committee bi-monthly. 2023 2023 Capital Budget 2023 Capital Budget as Adopted Capital Budget Presentation & Recording (Day 1) – February 13, 2023 Capital Budget Presentation & Recording (Day 2) – February 23, 2023 In accordance with the City’s Budget & Financial Controls Policy, the Capital Budget may be amended throughout the year. Below is the City’s up-to-date 2023 Capital Budget: 2023 Capital Budget as Amended 2023 Operating Budget 2023 Operating Budget Summary 2023 Operating Budget Presentation & Recording (Day 1) – April 5, 2023 2023 Operating Budget Recording (Day 2) – April 6, 2023 2023 Tax Impact Schedule 2023 Base Budget Adjustments - Taxation 2023 Operating Budget Issues Summary - Taxation 2023 Operating Details - Taxation 2023 Base Budget Adjustments - Parking Services 2023 Operating Issues - Parking Services 2023 Operating Detail Parking Services 2023 Base Budget Adjustments - Water 2023 Operating Issues - Water 2023 Operating Details - Water 2023 Base Budget Adjustments - Wastewater 2023 Operating Issues - Wastewater 2023 Operating Budget Detail - Wastewater Historical Budgets (2019-2022) Request a copy of the Historical Capital and Operating Budgets (2019-2022) Financial Statements Financial Statements are prepared annually and reviewed by an independent auditor. All statements are in compliance with Public Sector Accounting Standards for municipalities. Financial Statements Financial Statement - 2024 Financial Statement - 2023 Request a copy of the Financial Statements 2019-2022. Other Financial Reports Reserve Funds Reserve fund balances are reported to the City’s Finance Committee bi-monthly and in accordance with the City’s Reserve & Reserve Fund Policy. About FIR Reporting All Ontario municipalities are required to submit an annual Financial Information Return (FIR) to the Ministry of Municipal Affairs and Housing. To review the City’s annual submissions and compare with other municipalities, visit the Province's Financial Information Return website. Shoreline Casino Every year the City of Belleville receives quarterly payments from the Ontario Lottery and Gaming (OLG) Corporation for hosting the Shorelines Casino. The purpose of this funding is to provide Capital Funds to infrastructure projects in accordance with By-law 2020-10 and Amending By-law 2025-188. Funding (as amended) NamePercentage Casino – Infrastructure Maintenance/Rehab 65% Casino – Vehicle/Equipment Replacement 5% Casino – Economic Development 5% Casino – Development Infrastructure 5% Casino – Social Infrastructure 10% Casino – Healthcare 10% City of Belleville: Ontario Gaming Lottery - Income and Utilization of Funds Summary Get In Touch Stay up-to-date Subscribe to this page to get notified when this page has updated content. Notify Me Close Search Pop Up Search I Want To... Close I Want To menu Search Close Old Browser Notification Browser Compatibility Notification It appears you are trying to access this site using an outdated browser. As a result, parts of the site may not function properly for you. We recommend updating your browser to its most recent version at your earliest convenience."
  },
  {
    "municipality": "Belleville, City of",
    "source_type": "other",
    "title": "By-laws and Policies\n        - City of Belleville",
    "date": null,
    "source_url": "http://www.belleville.ca/en/city-hall/by-laws-and-policies.aspx",
    "text": "Close Alert Banner By-laws and Policies Decrease text size Default text size Increase text size Print This Page Share This Page Facebook Twitter LinkedIn Email Menu By-laws contained in this section, have been prepared for the purpose of convenience only and are not certified true copies. When available, consolidated versions including the original bylaw and any subsequent amendments are combined. City of Belleville By-laws City of Belleville Corporate Policies are sets of basic principles and associated guidelines, formulated and enforced by the Chief Administrative Officer and the Senior Leadership Team. Such policies are set to direct and limit actions in the pursuit of long-term goals. City of Belleville Policies Get In Touch Stay up-to-date Subscribe to this page to get notified when this page has updated content. Notify Me Close Search Pop Up Search I Want To... Close I Want To menu Search Close Old Browser Notification Browser Compatibility Notification It appears you are trying to access this site using an outdated browser. As a result, parts of the site may not function properly for you. We recommend updating your browser to its most recent version at your earliest convenience."
  },
  {
    "municipality": "Belleville, City of",
    "source_type": "other",
    "title": "CAO Biography\n        - City of Belleville",
    "date": null,
    "source_url": "http://www.belleville.ca/en/city-hall/cao-biography.aspx",
    "text": "Close Alert Banner CAO Biography Decrease text size Default text size Increase text size Print This Page Share This Page Facebook Twitter LinkedIn Email Menu Matt has over 25 years experience in the municipal sector and has most recently served as City Clerk and Director of Corporate Services since 2012. Prior to joining the City of Belleville, he held positions with the County of Prince Edward as Supervisor of Revenue Services/Tax Collector, the Ministry of Municipal Affairs and Housing as a Municipal Advisor and the Municipality of Centre Hastings as CAO/Clerk. Matt’s formal education is in legal administration, and he has furthered his education with the Association of Municipal Managers, Clerks and Treasurers of Ontario (AMCTO) through the Municipal Administration Program, as well as an Executive Diploma in Municipal Management. Matt leads a team of eight directors who form the Senior Leadership Team: Stephen Ashton, Director, Engineering and Development Services Marc Coyle, Director of Information Systems Perry Decola, Director, Environmental Services Brandon Ferguson, Treasurer/Director, Finance Director, Community Services Kari Lambe Dan Smith, Director/Chief, Fire and Emergency Services Marie Doherty, Director, People and Corporate Services Joe Reid, Director, Transportation and Operations Services Get In Touch Stay up-to-date Subscribe to this page to get notified when this page has updated content. Notify Me Close Search Pop Up Search I Want To... Close I Want To menu Search Close Old Browser Notification Browser Compatibility Notification It appears you are trying to access this site using an outdated browser. As a result, parts of the site may not function properly for you. We recommend updating your browser to its most recent version at your earliest convenience."
  },
  {
    "municipality": "Belleville, City of",
    "source_type": "council",
    "title": "Committees\n        - City of Belleville",
    "date": null,
    "source_url": "http://www.belleville.ca/en/city-hall/committees.aspx",
    "text": "Close Alert Banner Committees Decrease text size Default text size Increase text size Print This Page Share This Page Facebook Twitter LinkedIn Email Menu The City of Belleville has numerous Boards & Committees which are comprised of members of the current City Council in addition to citizen appointments. Thank you for your interest. Applications have now closed stay tuned for when the next recruitment period begins. Statutory Management Boards Police Services Board The Belleville Police Service Board is a five-member civilian board that governs the Belleville Police Service. Under the Police Services Act, the Board is responsible for providing adequate and effective police services to the citizens of the City of Belleville. The Belleville Police Services Board has five members: two Provincial appointees, two Council appointees, and one member of the community as appointed by Council. The Board provides direction and guidance to the Belleville Police Service while ensuring that adequate and effective police services are provided in accordance with the needs of the municipality. As civilian community members who represent the public's interests, the Police Service Board is committed to a high quality of community-based policing and excellence in police governance. The Board recognizes the challenges to law enforcement created by a changing environment, demographic shifts, emerging technologies, and evolving crime trends and patterns. Duties of the Board The responsibilities of the Police Service Board are outlined in section 31 (1) of Ontario's Police Services Act: Appoint the members of the municipal police force Generally determine, after consultation with the chief of police, objectives and priorities with respect to police services in the municipality Establish policies for the effective management of the police force Recruit and appoint the chief of police and any deputy chief of police, and annually determine their remuneration and working conditions, taking their submissions into account Direct the chief of police and monitor his or her performance Establish policies respecting the disclosure by chiefs of police of personal information about individuals Receive regular reports from the chief of police on disclosures and decisions made under section 49 (secondary activities) Establish guidelines with respect to the indemnification of members of the police force for legal costs under section 50 Establish guidelines for dealing with complaints made under Part V Review the chief of police's administration of the complaints system under Part V and receive regular reports from the chief of police on his or her administration of the complaints system Committee Members His Worship Mayor Ellis Councillor Enright-Miller, Chair (2024-160) Councillor Chatten, Alternate Jim O’Brien Contact Belleville Police Services Board Belleville Library Board The Belleville Public Library and John M. Parrott Art Gallery is a community meeting place that supports and inspires lifelong learning, creativity, growth and success by providing equitable access to information, print and digital resources, technology and the arts in a welcoming environment. The Library Board is appointed by the City Council through the Clerk's Office and is tasked with governing the Library and Gallery. Trustees provide financial oversight and are responsible for all aspects of the operations, through the hiring and supervision of the CEO. The Board meets a minimum of 10 times per year, usually monthly, and members of the public are welcome to attend. The Ontario Public Libraries Act provides the legal framework for providing library services to the public. Please visit our website for more information and public meeting dates. Term: Term of Council Committee Members Councillor Carr, Chair Councillor Seu (2024-186) Councillor Henderson (2025-104) Councillor Thompson, Alternate Sheridan Jennings (2024-153) Eric Lindenberg Philippe Appolon Ruth Ingersoll Michael Roberts Gerry Fraiberg Board of Management Belleville Downtown Improvement Area The Belleville Downtown Improvement Area (BDIA) is an association of commercial property owners and tenants in the downtown core who work in partnership with the City to make the City’s historic downtown the location of choice for investment, visitors, residents and shoppers and dining. Property owners in the BDIA are charged an additional levy on their property tax bill that collectively allows the Board to support beautification, marketing and events in the downtown. The Board of Management of the BDIA implement creates and implements their strategic plan TERM: Term of Council Councillor Thompson Councillor Seu, Alternate (2024-186) Maury Flunder Jessica Purchase (2024-121) Rakesh Parmar Emily Barnett Lindsay Dransfield Kim Fedor (2024-121) Nick Borestski (2024-121) Julie Dean Jennifer Hunter (2024-121) Edie Hasluer Statutory Committees Committee of Adjustment/Court of Revision/Property Standards (2025-193) The Committee of Adjustment is a quasi-judicial decision-making body that considers applications for Consent (to sever land), applications for minor variances from the Zoning By-law, and any other variances specified under the Planning Act R.S.O 1990. Term: Term of Council Committee Members Michael Harris (2023-204) Scott Giroux Robert Labarge Jack Alexander Brian Miller Joe Lentini Accessibility Advisory Committee The Belleville Accessibility Advisory Committee represents people with disabilities in our community and supports us with our responsibilities under the Accessibility for Ontarians with Disabilities Act. Check out information about the committee, current projects, upcoming meetings, and past meeting minutes. Committee Members Councillor Enright-Miller, Chair Councillor Kelly Ann Carr (2024-112) Janna Munkittrick–Colton Lorna Prevost Janet Richards Jeremy Davis Karen Kitchen Richard Williams Emergency Management Program Committee - Emergency Operations Control Group Emergency Management Program Committee: The Emergency Control Group (ECG): Deleted by By-law Number 2025-03 – Committee is listed in the Emergency Management Program and Emergency Response Plan By-law (2025-07) Joint Committees and Boards Quinte Conservation Authority Committee Members Councillor Henderson (2025-104) Councillor Carr Councillor Brown Councillor Enright-Miller, Alternate Southeast Public Health (2025-193) Committee Members Councillor Kelly Community & Human Services Committee Committee Members Councillor Carr (2025-94) Councillor Thompson Councillor Seu (2024-186) Councillor Brown Councillor Kelly, Alternate Hastings Quinte Emergency Services Committee Committee Members Councillor Chatten Councillor Henderson (2025-104) Councillor Thompson Councillor Kelly Councillor Enright-Miller, Alternate Hastings Quinte Long-Term Care Committee Committee Members Councillor Kelly Councillor Seu (2024-186) Councillor Brown Councillor Chatten, Alternate 9-1-1 Committee Committee Members Councillor Kelly Councillor Enright-Miller, Alternate Joint Provincial Offences Board Committee Members Councillor Chatten Councillor Enright-Miller Councillor Brown, Alternate Centre and South Hastings Waste Services Board The Centre and South Hastings Waste Services Board is a municipal service board operating as Quinte Waste Solutions. Committee Members Councillor Thompson TBD, Alternate Stirling & District Recreation Centre The Stirling & District Recreation Centre is established as a joint arena-recreation centre with the Township of Stirling-Rawdon, City of Quinte West, City of Belleville and Municipality of Centre Hastings to incur all costs associated with the establishment, development, management, control and operation of the Centre and costs shall be shared on a usage percentage basis. Committee Members Councillor Carr Councillor Henderson (2025-104) Councillor Brown, Alternate Quinte Economic Development Commission (QEDC) Committee Members His Worship Mayor Ellis Councillor Brown (2024-186) Councillor Carr, Alternate Ross Rae Robert Stokes Quinte Source Protection Committee Committee Members Councillor Thompson Councillor Henderson, Alternate (2025-104) Archives Committee The City and County agree to establish a joint advisory committee (hereinafter called the \"Archives Advisory Committee\" to provide direction and advice respecting governance of the joint archives, with such advisory committee reporting to Belleville City Council. Committee Members Councillor Henderson (2025-104) Councillor Thompson Councillor Brown, Alternate Bay of Quinte Regional Marketing Board The Bay of Quinte Regional Marketing Board is a regional tourism marketing organization responsible for marketing the City of Belleville, the City of Quinte West, the Mohawks of the Bay of Quinte and the Municipality of Brighton. Their focus is on marketing the region to potential visitors in order to drive tourist traffic and overnight stays in the region. The Board also functions as the Destination Marketing Organization for the region. Committee Members Councillor Thompson (2024-186) Councillor Kelly, Alternate (2024-186) Terms of Reference Mandate The Bay of Quinte Regional Marketing Board (BQ RMB) was established in 1982 by regional partners interested in furthering economic activity by working together. It acts as a destination marketing and management organization, undertaking activities for the purposes of supporting tourism and resident attraction regionally, provincially, nationally and internationally on behalf of the paying partners. The BQ RMB will act as the lead agency on behalf of the partnership for the purposes of: Uniting the partner communities under a regional brand in an effort to increase economic activity related to tourism and resident attraction Identifying target regions and demographics to attract for the purposes of tourism and resident attraction Creating and delivering destination marketing campaigns and tactics to attract the identified targets to the region Working in collaboration with Regional Tourism Organizations, Destination Ontario and Destination Canada on destination marketing and management initiatives The BQRMB will act as the Eligible Tourism Entity for the purposes of the Municipal Accommodation Tax, as approved by the Councils of the City of Belleville and City of Quinte West with respect to the Municipal Act Members Subject to the articles, there shall be one class of members in the Corporation. Membership in the Corporation shall be available to municipalities, First Nations and not-for-profit corporations interested in furthering the Corporation's purposes and who have applied for and been accepted into membership in the Corporation by resolution of the board or in such other manner as may be determined by the board. Each member shall be entitled to receive notice of, attend and vote at all meetings of the members of the Corporation. The board shall be comprised of a minimum of three (3) and a maximum of twelve (12) directors. Paying members can appoint the individual they wish to represent their organization on the board, or allow for an election of approved candidates to fill the position. Each paying member has one seat. There shall be a minimum of one (1) at-large position made available to round out the skill set of the Board as needed. The number of at-large positions shall not exceed the number of positions held by paying partners. The directors shall be elected to hold office for a term expiring not later than the close of the annual meeting of members following the election. Current Partnership City of Belleville City of Quinte West Mohawks of the Bay of Quinte Municipality of Brighton Quinte Home Builders Association Quinte Restaurant Association Meetings The board may appoint a day or days in any month or months for regular meetings of the board at a place and hour to be named. There shall be a minimum of six (6) regular meetings of the board per year. A copy of any resolution of the board fixing the place and time of such regular meetings of the board shall be sent to each director forthwith after being passed, but no other notice shall be required for any such regular meeting except if subsection 136(3) (Notice of Meeting) of the Act requires the purpose thereof or the business to be transacted to be specified in the notice. Executive or administrative staff of any member shall be eligible to attend regular meetings of the board, but shall not participate in deliberations or vote. Voting At all meetings of the board, every question shall be decided by a majority of the votes cast on the question. In case of an equality of votes, the chair of the meeting in addition to an original vote shall have a second or casting vote. Amendments This Terms of Reference may be amended, varied or modified in writing after consultation and agreement by the Board of Directors Advisory Committees Planning Advisory Committee The Planning Advisory Committee provides advice and makes recommendations to Council regarding land use, development and community planning. Committee Members Councillor Carr, Chair Councillor Brown Councillor Kelly (2024-186) Councillor Henderson (2025-104) Councillor Enright-Miller Sarita Van Dyke Tyler Fenton Paul Jennings John Baltutis Councillor Chatten Alternate (2024-186) Councillor Seu, Alternate (2024-186) City Council Planning Committee Committee Members Councillor Carr, Chair Councillor Brown (2024-186) Councillor Kelly Councillor Henderson (2025-104) Councillor Enright-Miller Councillor Chatten, Alternate (2024-186) Councillor Seu, Alternate 92024-186) Heritage Committee (2025-193) The Heritage Committee advises Council on local heritage matters and assist them in carrying out heritage conservation programs. Committee Members Karen Fisk Franklin Cross (2025-193) JP Lemieux Janna Munkittrick-Colton (2024-87) Mark Stoliker Vacant Vacant Finance Committee The Finance Committee is comprised of the Mayor and two Council members and assists, advises and makes recommendations to Council regarding the fulfillment of Council's oversight responsibilities relative to City financial reporting, external audit requirements, asset management, internal controls, and compliance with financial regulations and policies. The Finance Committee provides a forum for communication between Council, the External Auditor and Management, and facilitates an impartial, objective and independent review of financial management practices. Committee Members His Worship Mayor Ellis Councillor Carr Councillor Enright-Miller, Chair Councillor Thompson, Alternate Reference Request a copy of the Finance Committee Terms of Reference Committee agendas are published the Friday prior to the meeting. Committee Minutes Contact Jennifer Knight - Coordinator - Revenue & Customer Service613-967-3200 extension 3213 Museum Services Advisory Committee (2024-181) Committee Members Councillor Henderson (2025-104) Councillor Brown, Chair Jeremy Davis Trevor Parsons Vacant Mike Beeston Greg Antworth (2024-196) Transit Operations Advisory Committee The mandate of the Transit Advisory Committee is to: Review the transportation (transit) services in the City in terms of efficiency, effectiveness, and accessibility for all citizens; Provide recommendations to Council and staff on proposed or preferred modifications to transit services The committee meets monthly and is comprised of three members of Council and four citizen appointees. Committee Members Councillor Brown, Chair Councillor Thompson Councillor Seu (2024-186) Veronica Leonard Greg Antworth (2023-164) Dwain Hilts Richard Williams (2024-112) Reference Committee Agendas and Minutes Green Task Force The Green Task Force is a committee of Council made up of seven voting members: five citizen appointees and two councillors. We bring forward recommendations and ideas for Council to consider that improve Belleville's environmental performance. Committee Members Councillor Enright-Miller, Chair (2025-104) Councillor Henderson (2025-104) Mike Beeston (2023-186) Peter Whittle Janet Richards (2023-186) Gary Magwood Karrin Broadhurst Greg Dickson Grant Committee The Grant Committee is committed to assisting not-for-profit and other community organizations based in Belleville who promote the well-being of our community. Committee Members His Worship Mayor Ellis Councillor Carr Councillor Chatten, Chair Councillor Henderson (2025-104) Reference Committee agendas are published the Friday prior to the meeting and can be viewed here. Request a copy of the Grant Committee Terms of Reference Grant Committee Policy Grant Applications Belleville Youth Engagement Committee The Belleville Youth Engagement Committee is made up of eight community representatives between the ages of 15 and 29 and two councillors. The committee advises council based on the interest of youth in our community and engages and educates youth on opportunities and resources available to them. Committee Members Councillor Chatten Councillor Kelly, Chair Callie McGrath (2025-35) Olivia Millard (2024-167) Hillary Winstanley (2024-167) Peter Matwyuk (2024-167) Sophia Watts-Horricks (2025-35) TBD (2024-196) Transportation Committee The Transportation Committee’s mandate includes the following: Review transportation related issues as may be identified for review by a City Department or City Council Act in an advisory capacity to City Council on issues specific to transportation and provide recommendations to Council regarding any suggested improvements Review, advise and assist in implementing transportation policies, programs and facilities that help to increase active transportation Please review the Committee's process for requesting a change to traffic signage, parking, speed limits, and other transportation concerns. Committee Members Councillor Carr Councillor Kelly Councillor Thompson, Chair Councillor Brown Robert Jakes Paul Jennings (2023-164) Economic Development Committee (2025-132) The Economic Development Committee provides strategic recommendations to City Council regarding the resources required to support investment attraction, business growth and retention, tourism and economic development issues management. The EDC provides the Economic Development Division staff with information and input on issues and projects of particular importance to the local economy. The committee is currently development a 5-year Economic Development Strategic Plan for Council’s approval and launching an Industrial Sector BR+E. Committee Members Councillor Kelly, Chair Councillor Henderson Councillor Seu Councillor Thompson Jodie Jenkins Brian Pennell Ian Stock Belleville Chamber of Commerce representative Loyalist College representative, resident of Belleville Accommodations Sector representative Belleville Downtown Improvement Area representative References Agendas Minutes Protective Services Advisory Committee Committee Members Removed by By-law 2024-186 Special Purposes Boards and Committees Lighting Display and Gateway Signage Committee The Lighting Display and Gateway Signage Committee works co-operatively on the Christmas Festival of Lights display, BELLEVILLE sign, Canada Day fireworks and gateway/wayfinding signage. Committee Members Councillor Thompson, Chair Councillor Chatten Councillor Enright-Miller Scott Lalonde James Feenstra Annis Ross TBD (2024-196) Reference Festival of Lights Sponsorship opportunities HR Committee (2025-13) Committee Members Councillor Enright-Miller Councillor Carr Councillor Brown, Chair Equity, Diversity and Inclusion Committee (2023-35) The mandate of the Belleville inclusion committee is to: Provide recommendations regarding policies, procedures, and best practices for creating an equitable, diverse, and inclusive environment Collaborate with community and partners to identify and develop opportunities for education, support, and engagement Develop an action plan designed to engage and promote community involvement Cultivate activities and initiatives that will help eliminate discrimination and/or amplify voices Committee Members Councillor Kelly, Chair Councillor Seu (2024-186) Councillor Brown UNAC Quinte Rep. Belleville Police Service Rep. Quinte United Immigrant Services Rep. Loyalist College Rep. Community Development Corp. Rep. Bay of Quinte Pride Rep. United Way Hastings Prince Edward Rep. YMCA Rep. Joy Martin Corinne Sykes John Bruce (2025-35) TBD (2024-196) TBD (2024-196) TBD (2024-196) Understanding Homelessness Task Force (2026-004) Councillor Thompson Corporate Appointments Elexicon Board of Directors Committee Members His Worship Mayor Ellis (TBD) Doug Parker (Elexicon) (TBD), Alternate Quinte Health Care Corporation (Advisory Members) (Not a Committee of Council) John Baltutis Rick McIvor TBD Community Safety & Wellbeing Committee (2026-004) Advisory Committee: Councillor Carr Governance Committee: Councillor Carr, Chair Get In Touch Stay up-to-date Subscribe to this page to get notified when this page has updated content. Notify Me Close Search Pop Up Search I Want To... Close I Want To menu Search Close Old Browser Notification Browser Compatibility Notification It appears you are trying to access this site using an outdated browser. As a result, parts of the site may not function properly for you. We recommend updating your browser to its most recent version at your earliest convenience."
  },
  {
    "municipality": "Belleville, City of",
    "source_type": "council",
    "title": "Community Funding and Grants\n        - City of Belleville",
    "date": null,
    "source_url": "http://www.belleville.ca/en/city-hall/community-funding-and-grants.aspx",
    "text": "Close Alert Banner Community Funding and Grants Decrease text size Default text size Increase text size Print This Page Share This Page Facebook Twitter LinkedIn Email Menu We are hosting a City Grant Writing Workshop! Join us March 4 to learn more about the City's grant process, tips on writing a grant application and how to start the process of becoming a not-for-profit organization. Learn more and register today. We are committed to assisting not-for-profit and other community organizations based in Belleville who promote the well-being of our community. Read our Grant Policy for more information about eligibility, how to apply, and the application process. Available Grants Community Impact Grant Applications for the Community Impact Grant are now closed. 2026 Intake Dates First Round: Nov. 25, 2025 to Jan. 9, 2026 Second Round: May 1, 2026 to June 15, 2026 Application Guidelines Community Impact Grant Application Community Impact Grant Final Report Goal To provide funding in a fair and equitable manner to organizations, groups and events that promote the well-being and growth of the community. Available Funding Single grants up to $10,000 maximum between financial assistance and/or municipal resources. Please note that municipal resources will be covered prior to financial assistance, based on final contract costs. A list of estimated City in-kind requests must be provided with the application. Municipal resources eligible for grants include: Use of a municipally-owned facility (rental fee waived or reduced) Municipal staff support and expertise provided for event (wages waived or reduced) Use of municipally-owned equipment or materials (rental fee waived or reduced) Evaluation Criteria Staff will review applications and make recommendations to the committee based on set criteria. This includes the demonstrated need for the specific grant and overall impact on the community. Not all eligible applications will receive funding. All grant decisions are subject to the approval of Mayor and Council in the form of a resolution of support. Council’s decisions are final. Funding Intake Twice per year; with the application period and due dates approved by the Grant Committee Funding Conditions Applicants Eligible: Registered not-for-profit and registered charities. The event or service delivery must take place within the City of Belleville. Applicants must demonstrate the need for the specific grant request. All requests must be made to the Grant Committee using the Community Impact Grant Application. Applications must demonstrate that the activity for which funds are sought will help to achieve one of the city's nine strategic themes. Ineligible: Individuals Political parties For-profit businesses School boards Organizations whose primary focus is not within the City of Belleville. Applicants who have failed to comply with any reporting requirements from previous grants or have failed to demonstrate favourable outcomes from previous grants. Cannot obtain $5M liability insurance Do not have bank account in organization’s name. Organizations with past due balances owing to the City of Belleville. Organizations serving as funding sources for others example: service clubs. Use of Funds Eligible: Event expenses, venue rental, supplies, etc. One time salary for event or service delivery organizer specific to this event only S.O.C.A.N fees One time funding for registration fees to become a not-for-profit or charity (up to $2,500). This amount is included withinthe $10,000 maximum grant request. This is only available to an organization if their mandate involves a Community Impactinitiative. Applicant can only apply for this through one funding stream. If the applicant is not successful in becoming aregistered not-for-profit or charitable organization this one-time funding must be paid back to the City. Ineligible: Annual Salary of event organizers Security expenses Prize money Electrical hook-up fees Development related waiver of fees Building permit fees Annual operating costs Projects that will be the city’s responsibility or become city assets Terms and Conditions Event must take place on the proposed date. Any changes to the date must be approved by the Grant Committee Application must demonstrate the need for this Community Impact offering within the City of Belleville, and the demand for such an event. Only applications submitted on time will be considered. Applicants must have a bank account in applicant’s name. Applicants must be able to get insurance in applicant’s name. Applications must be submitted at least 6 months 90 days prior to the proposed event date. All successful applicants must consult with the City's Business Continuity and Emergency Management Coordinator to develop an Emergency Management Plan. All event volunteers must be trained in the deployment of that Emergency Management Plan. It is recommended that organizers contact the City's Community Services Department and Parks Department prior to submitting their application to discuss what is required for the event. Events with attendance greater than 100 must fill out the Special Events form and follow the Special Event Guidelines. All successful applicants must work with the City's Community Services Department and Parks Department to coordinate City in- kind services and event logistics where required. Only one application per organization can be submitted per year, per funding stream. The initiative for each funding stream must be different. In executing grants, the municipality may impose specific contractual conditions and/or restrictions as it deems fit. No deputation to Council will be received from the applicant regarding requests for funding while application is being considered. Applicants should not rely on this funding as a recurring source of support. Applicants must also demonstrate a plan for sustainability beyond the grant period A follow-up report must be submitted to the Staff Review Committee within three (3) months of the event detailing the outcome and how the funds were spent, including measurable, tangible results and outcomes of the grant. The City reserves the right to limit the number of applications an organization submits. Requests for Community Impact Grants will be assessed by the Staff Review Committee and recommendations brought to the Grant Committee. Grants made by the municipality are not to be regarded as a commitment by the municipality to continue such grants in the future. Grants will be approved and issued for the current operating period, some pre-approvals for the following year may be granted at the discretion of the Committee and Council. Applicants requiring funding beyond the current period will be required to re-apply on an annual basis. In executing grants, the municipality may impose specific contractual conditions and/or restrictions as it deems it. Applicants must demonstrate it does not have the resources or ability to raise the resources to undertake the activity for which funds are sought. Funds must be spent within one year of grant approval. Scoring Matrix (For Reference Only) Scoring Matrix (For Reference Only) Criteria Point Value Does the project align with one of the City's Strategic Plan Initiatives? Organization must demonstrate how their application aligns with at least one of the city's strategic plan initiatives 0 - 15 Is the anticipated impact a positive one for the community? Organization must demonstrate how their event will positively contribute to the community 0 - 20 Is there evidence that this is needed in the City? Is the event unique in the community (not a duplication of other programs or services)? 0 - 20 Has the organization indicated a clear financial plan? Has the organization demonstrated efficient use of City funds for the event? 0 - 20 Has clear targets and outcomes been identified? Has the organization provided clear measurements for targets and outcomes? Will the target group be interested in the event? 0 - 20 Has the organization identified it has reached out to form financial or in kind participation of other partners or sponsors? 0 - 15 Has the organization considered diversity, inclusion and accessibility in the programming and delivery of the event? 0 -15 Has the organization demonstrated it has experience delivering safe, inclusive and successful events in the past? 0 - 15 PLEASE NOTE: THIS APPLICATION WILL BE PART OF A PUBLIC AGENDA Tourism Grant Applications for the Tourism Grant are open now until Jan. 30, 2026 at 4:30 p.m. 2026 Intake Dates First Round: Dec. 1, 2025 to Jan. 30, 2026 Second Round: March 2, 2026 to April 30, 2026 Application Guidelines Tourism Grant Application Tourism Grant Final Report Goals Annual funding to support events that draw visitors from outside the City to Belleville, provide local entertainment, promote new spending and overnight stays in the City and promote the city as an attractive destination for visitors. Tourism events will fill a void in the City's event calendar and will provide activities that meet current tourism market demand. The grants will support the realization of the City's strategic goals by supporting community-based partners on a priority basis and in a fair and equitable manner. Available Funding Single grants up to $10,000 maximum between financial assistance and/or municipal resources. Please note that municipal resources will be covered prior to financial assistance, based on final contract costs. list of estimated City in-kind requests must be provided with the application. Municipal resources eligible for grants include: Use of a municipally-owned facility (rental fee waived or reduced) Municipal staff support and expertise provided for event (wages waived or reduced) Use of municipally-owned equipment or materials (rental fee waived or reduced) Evaluation Criteria Staff will review applications and make recommendations to the committee based on set criteria. This includes the demonstrated need for the specific grant and overall impact on the community. Not all eligible applications will receive funding. All grant decisions are subject to the approval of Mayor and Council in the form of a resolution of support. Decisions are final. Funding Intakes Twice per year; with the application periods and due dates approved by the Grant Committee. Funding Conditions Applicants Eligible: Registered not-for-profit and registered charities. Applicants must demonstrate the need for the specific grant request. Applicants who can provide previous financial statements upon request. All requests must be directed to the Grant Committee using the online Tourism Grant Application. Applications must demonstrate that the activity for which funds are sought will help achieve one of the city's strategic themes. Ineligible: Individuals Political parties For-profit businesses School boards Organizations whose primary focus is not within the City of Belleville. Applicants who have previously failed to meet the conditions of their City grant including submitting a final report within 3 months of the event, or who have failed to demonstrate favorable outcomes from previous grants. Organizations with past due balances owing to the City. Organizations serving as funding sources for others (e.g. service clubs) Cannot obtain $5M liability insurance Do not have bank account in organization’s name Use of Funds Eligible: Support cultural and multi-cultural, conferences, sports events, festivals, tournaments conventions. Event expenses: Insurance, talent, equipment rental, marketing, venue rental, supplies, etc. One time salary for event or service delivery organizer specific to this event only. S.O.C.A.N. Fees One time funding for registration fees to become a not-for-profit or charity (up to $2,500). This amount is included within the $10,000 maximum grant request. This is only available to an organization if their mandate involves a Tourism initiative. Applicant can only apply for this through one funding stream. . If the applicant is not successful in becoming a registered not for-profit or charitable organization this one-time funding must be paid back to the City. Ineligible: Annual operating expenses Annual salary of event organizers Waiver of City fees (e.g. building permit) Electrical hookup fees Security expenses Support single, faith-based events Prize money Projects that will be the City’s responsibility or become City assets Terms and Conditions Event must take place on the proposed date. Any changes to the date must be approved by the Grant Committee. Application must demonstrate the need for this tourism offering within the City of Belleville, and the demand for such an event. Only applications submitted on time will be considered. Applicants must have a bank account in applicant’s name. Applicants must be able to get insurance in applicant’s name. Applications must be submitted at least 90 days prior to the proposed event date. All successful applicants must consult with the City's Business Continuity and Emergency Management Coordinator to develop an Emergency Management Plan. All event volunteers must be trained in the deployment of that Emergency Management Plan. It is recommended that organizers contact the City's Community Services Department and Parks Department prior to submitting their application to discuss what is required for the event. Events with attendance greater than 100 must fill out the Special Events form and follow the Special Event Guidelines. City in- kind services and event logistics where required. Only one application per organization can be submitted per year, per funding stream. The initiative for each funding stream must be different. In executing grants, the municipality may impose specific contractual conditions and/or restrictions as it deems fit. No deputation to Council will be received from the applicant regarding requests for funding while an application is being considered. Applicants should not rely on this funding as a recurring source of support. Applicants must also demonstrate a plan for sustainability beyond the grant period A follow-up report must be submitted to the Grant Committee within three (3) months of the event detailing the outcome and how the funds were spent, including measurable, tangible results and outcomes of the grant. The City reserves the right to limit the number of applications an organization submits. Requests for Community Impact Grants will be assessed by the Staff Review Committee and recommendations brought to the Grant Committee. Grants made by the municipality are not to be regarded as a commitment by the municipality to continue such grants in the future. Grants will be approved and issued for the current operating period, some pre-approvals for the following year may be granted at the discretion of the Committee and Council. Applicants requiring funding beyond the current period will be required to re-apply on an annual basis. In executing grants, the municipality may impose specific contractual conditions and/or restrictions as it deems it. Applicants must demonstrate it does not have the resources or ability to raise the resources to undertake the activity for which funds are sought. Funds must be spent within one year of grant approval. Scoring Matrix (For Reference Only) Scoring Matrix (For Reference Only) Criteria Point Value Does the project align with one of the City's Strategic Plan Initiatives? Organization must demonstrate how their application aligns with at least one of the city's strategic plan initiatives 0 - 15 Is the anticipated impact a positive one for the community? Organization must demonstrate how their event will positively contribute to the community 0 - 20 Is there evidence that this is needed in the City? Is the event unique in the community (not a duplication of other programs or services)? 0 - 25 Has the organization indicated a clear financial plan? Has the organization demonstrated efficient use of City funds for the event? 0 - 20 Has clear targets and outcomes been identified? Has the organization provided clear measurements for targets and outcomes? Will the target group be interested in the event? 0 - 20 Has the organization identified it has reached out to form financial or in kind participation of other partners or sponsors? 0 - 15 Has the organization considered diversity, inclusion and accessibility in the programming and delivery of the event? 0 -15 Has the organization demonstrated it has experience delivering safe, inclusive and successful events in the past? 0 - 15 Has the organization demonstrated the potential for the event to become an annual event, supported independently by the organization 0 - 20 Social Infrastructure Funding Application Applications for the Social Infrastructure Grant are now closed. 2026 Intake Dates Feb. 2, 2026 March 31, 2026 (One Round) Application Guidelines Social Infrastructure Grant (Closed) Social Infrastructure Grant Final Report Goal To provide funding to non-profit organizations that primarily provide services to individuals who are experiencing adverse social impacts due to the economy, housing, physical, family, cultural, social exclusion, disabilities, and ethnic/ racial/ religious factors. Available Funding Singe grants up to $20,000 Evaluation Criteria Staff will review applications and make recommendations to the committee based on set criteria as outlined in appendix. This includes the demonstrated need for the specific grant and overall impact on the community. All grant decisions are subject to the approval of Mayor and Council in the form of a resolution of support. Council’s decisions are final. Funding Intake Once per year, with the application period and due date approved by the Grant Committee Funding Conditions 1. Applicants: Only applications submitted on time will be considered. a) Eligible: Applicants must be located in the City of Belleville. Applicants must demonstrate the need for the specific grant request. All requests must be directed to the Grant Committee using the Social Infrastructure Grant Application. Applications must demonstrate that the activity for which funds are sought will help to achieve the city’s strategic theme of Community Health, and Security. b) Ineligible: Organizations whose primary focus is not within the City of Belleville. Applicants who have failed to comply with any reporting requirements from previous Social Infrastructure grants or have failed to demonstrate favorable outcomes from previous grants. Organizations with past due balances owing the City of Belleville will not be eligible for grants. 2. Requests for Social Infrastructure Grants will be assessed by the Staff Review Committee and recommendations brought to the Grant Committee. 3. Grants made by the municipality are not to be regarded as a commitment by the municipality to continue such grants in the future. Grants will be approved and issued for the current operating period. Applicants requiring funding beyond the current period will be required to re-apply on an annual basis. 4. In executing grants, the municipality may impose specific contractual conditions and/or restrictions as it deems fit. 5. Use of Funds: a) Eligible use of Funds: Event expenses, venue rental, supplies, etc. b) Ineligible use of Funds: Salaries of event organizers Security expenses Prize money 6. Applicant must demonstrate it does not have the resources or ability to raise the resources to undertake the activity for which funds are sought. 7. Must have a bank account in the organization’s name. 8. Only one application per organization can be submitted per year, per funding stream. 9. A follow up report must be submitted within three (3) months to the Grant Committee within 3 months of the event detailing the outcome and how the funds were spent, including measurable, tangible results and outcomes of the grant. 10. Funds must be spent within one year. Scoring Matrix (For Reference Only) Scoring Matrix (For Reference Only) Criteria Point Value Does the project align with one of the City's Strategic Plan Initiatives? Organization must demonstrate how their application aligns with at least one of the city's strategic plan initiatives 0 - 15 Does the organization provide one of the primary services outlined in the Social Infrastructure criteria such as experiencing adverse social impacts due to the economy, housing, physical, family, cultural, social exclusion, disabled and ethnic/ racial/ religious factors? 0 - 25 Is the anticipated impact a positive one for the community? Organization must demonstrate how their event will positively contribute to the community 0 - 20 Is there evidence that this is needed in the City? Is the event unique in the community (not a duplication of other programs or services)? 0 - 20 Has the organization indicated a clear financial plan? Has the organization demonstrated efficient use of City funds for the event? 0 - 20 Has clear targets and outcomes been identified? Has the organization provided clear measurements for targets and outcomes? Will the target group be interested in the event? 0 - 20 Has the organization identified it has reached out to form financial or in kind participation of other partners or sponsors? 0 - 15 Has the organization considered diversity, inclusion and accessibility in the programming and delivery of the event? 0 -15 Has the organization demonstrated it has experience delivering safe, inclusive and successful events in the past? 0 - 15 PLEASE NOTE: THIS APPLICATION WILL BE PART OF A PUBLIC AGENDA Arts and Culture Grant Applications for the Arts & Culture Grant are now closed. 2026 Intake Dates April 1, 2026 to May 29, 2026 (One Round) Application Guidelines Arts & Culture Grant Application (Closed) Arts & Culture Grant Final Report Goal To provide funding to bolster the local arts and culture sector’s impact on the quality of life of local residents and the economic vitality of the community. The grants will support the realization of the City’s strategic theme of Arts, Culture and Recreation. Available Funding Single grants of up to $5,000 Evaluation Criteria Staff will review applications and make recommendations to the committee based on set criteria. This includes the contribution to the arts and culture environment and overall impact on the community. All grant decisions are subject to the approval of Mayor and Council in the form of a resolution of support. Council’s decisions are final. Funding Intake Once per year, with the application period and due date approved by the Grant Committee Funding Conditions 1. Applicants: a) Eligible: Applicants must be located in the City of Belleville. Applicants must demonstrate the need for the specific grant request. All requests must be directed to the Grant Committee using the Community Arts & Culture Grant Application. Applications must demonstrate that the activity for which funds are sought will help to achieve the city’s strategic theme of Arts, Culture and Recreation by: Creating hubs for community arts and culture programs, services, and engagement. Supporting artists and cultural organizations create learning, professional development, exhibition, performance opportunities. Promoting partnerships and collaborations that create new relationships, opportunities and visibility for Indigenous and other diverse artists, arts and culture leaders and professionals. Improving public spaces and replacing graffiti vandalism with colourful and attractive street art. Promoting the City’s unique history and heritage. Fostering innovation, collaboration, and excellence across a spectrum of artistic and cultural disciplines and modes of expression. b) Ineligible: Organizations whose primary focus is not with the City of Belleville. Applicants who have failed to comply with any reporting requirements from previous Arts & Culture grants or have failed to demonstrate favorable outcomes from previous grants. Organizations with past due balances owing to the City of Belleville will not be eligible for grants. 2. Only applications submitted on time will be considered 3. Requests for Community Arts & Culture Grants will be assessed by the Staff Review Committee and recommendations brought to the Grant Committee. 4. Grants made by the municipality are not to be regarded as a commitment by the municipality to continue such grants in the future. Grants will be approved and issued for the current operating period. Applicants requiring funding beyond the current period will be required to re-apply on an annual basis. 5. In executing grants, the municipality may impose such conditions and/or restrictions as it deems it. 6. Use of Funds: a) Eligible use of Funds: Event expenses: Talent, equipment rental, marketing, venue rental, supplies, etc. b) Ineligible use of Funds: Salaries of event organizers Waiver of City fees (e.g. building permit) Prize money S.O.C.A.N. fees Building permit fees Security expenses Electrical hook-ups 7. Applicant must demonstrate it does not have the resources or ability to raise the resources to undertake the activity for which funds are sought. 8. Event must take place on the proposed date. Any changes must be approved by the Grant Committee. 9. Only one application per organization can be submitted per year, per funding stream. 10. Must have a bank account in the organization’s name. 11. A follow-up report must be submitted to the Grant Committee within 3 months of the event detailing the outcome and how the funds were spent, including measurable, tangible results and outcomes of the grant. Scoring Matrix (For Reference Only) Scoring Matrix (For Reference Only) Criteria Point Value Does the project align with one of the City's Strategic Plan Initiatives? Organization must demonstrate how their application aligns with at least one of the city's strategic plan initiatives 0 - 15 Is the anticipated impact a positive one for the community? Organization must demonstrate how their event will positively contribute to the community 0 - 20 Is there evidence that this is needed in the City? Is the event unique in the community (not a duplication of other programs or services)? 0 - 20 Has the organization indicated a clear financial plan? Has the organization demonstrated efficient use of City funds for the event? Is there evidence the event can be supported independently by the applicant in the future? 0 - 20 Has clear targets and outcomes been identified? Has the organization provided clear measurements for targets and outcomes? Will the target group be interested in the event? 0 - 20 Has the applicant demonstrated the activity will help achieve the city's strategic theme of Arts, Culture and Recreation: Creating hubs for community arts and culture programs, services and engagement. Supporting artists and cultural organizations create learning, professional development, exhibition, performance opportunities Promoting partnerships and collaborations that create new relationships, opportunities and visibility for indigenous and other diverse artists, arts and culture leaders and professionals Improving public spaces and replacing graffiti vandalism with colourful and attractive street art Promoting the City’s unique history and heritage Fostering innovation, collaboration and excellence across a spectrum of artistic and cultural disciplines and modes of expression 0 - 20 Has the organization considered diversity, inclusion and accessibility in the programming and delivery of the event? 0 -15 Has the organization demonstrated it has experience delivering safe, inclusive and successful events in the past? 0 - 15 PLEASE NOTE: THIS APPLICATION WILL BE PART OF A PUBLIC AGENDA Community Improvement Plans Community Improvement Plans (CIP) allows the City to direct funds and implement initiatives towards specific projects that encourage rehabilitation and/or development to enhance a sustainable community Contact 169 Front Street Belleville, ON K8N 2Y8Telephone: 613-968-6481 ext. 3213TTY: 613-967-3768Fax: 613-967-3206grantcommittee@belleville.ca Elexicon Energy supports local registered charities and non-profit organizations through their Corporate Giving Program. Funds are distributed based on alignment with their mission and vision for the future and applications remain open until all funding is distributed. Learn more and apply today https://forms.belleville.ca/Finance/City-Grant-Writing-Workshop-Registration Get In Touch Stay up-to-date Subscribe to this page to get notified when this page has updated content. Notify Me Close Search Pop Up Search I Want To... Close I Want To menu Search Close Old Browser Notification Browser Compatibility Notification It appears you are trying to access this site using an outdated browser. As a result, parts of the site may not function properly for you. We recommend updating your browser to its most recent version at your earliest convenience."
  },
  {
    "municipality": "Belleville, City of",
    "source_type": "council",
    "title": "Council\n        - City of Belleville",
    "date": null,
    "source_url": "http://www.belleville.ca/en/city-hall/council.aspx",
    "text": "Close Alert Banner Council Decrease text size Default text size Increase text size Print This Page Share This Page Facebook Twitter LinkedIn Email Menu Agendas, Minutes and Live Meeting Video The City of Belleville is represented by City Council that consists of the Mayor (who is elected at-large) and eight Councillors (six of whom are elected from the 'Belleville' Ward and two from the 'Thurlow' Ward). Each Councillor, in addition to sitting on Council, is also appointed to numerous Committees and Boards whose duties range from providing advice to Council to carrying out policies or programs of the City. Some Committees consist solely of Members of Council, and others include representatives appointed from the community. Some Committees (such as the Library Board and the Belleville Police Services Board) do not operate under the direct control of Council, but do have representation from City Council. Function: A municipal Council is the ultimate authority, subject to provincial law, for all actions taken on behalf of the municipal corporation in that it exercises both executive and legislative roles. It fulfills its role by making policies in accordance with the wishes and concerns of the general public, subject to provincial laws, policies and directives. Council plays a managerial role by monitoring ongoing administrative performance and ensuring the best care of resources. The Mayor is the ceremonial leader and spokesperson for the municipality, acts as presiding officer at meetings and has the authority to call special meetings and determine agenda items. The Mayor serves as an ex-officio member on many Boards and Committees, as well as the many Committees of Council. The Ontario Municipal Act sets out the role of the Head of Council (Mayor) and Members of Council as follows: Role of Head of Council It is the role of the Head of Council: (a) to act as chief executive officer of the municipality;(b) to preside over council meetings;(c) to provide leadership to the council;(d) to represent the municipality at official functions; and(e) to carry out the duties of the head of council under this or any other Act. Role of Council It is the role of Council: (a) to represent the public and to consider the well-being and interests of the municipality;(b) to develop and evaluate the policies and programs of the municipality;(c) to determine which services the municipality provides;(d) to ensure that administrative practices and procedures are in place to implement the decisions of council;(e) to maintain the financial integrity of the municipality; and(f) to carry out the duties of council under this or any other Act. Get In Touch Stay up-to-date Subscribe to this page to get notified when this page has updated content. Notify Me Close Search Pop Up Search I Want To... Close I Want To menu Search Close Old Browser Notification Browser Compatibility Notification It appears you are trying to access this site using an outdated browser. As a result, parts of the site may not function properly for you. We recommend updating your browser to its most recent version at your earliest convenience."
  },
  {
    "municipality": "Belleville, City of",
    "source_type": "council",
    "title": "Councillors\n        - City of Belleville",
    "date": null,
    "source_url": "http://www.belleville.ca/en/city-hall/councillors.aspx?_mid_=76750",
    "text": "Close Alert Banner Councillors Decrease text size Default text size Increase text size Print This Page Share This Page Facebook Twitter LinkedIn Email Menu Ward 1 Councillors Lisa Anne Chatten Member Since: November 2022 Telephone: 613-848-5841 Email: councillor.chatten@belleville.ca Barbara Enright-Miller Member Since: November 2022 Telephone: 613-849-7586 Email: councillor.enright-miller@belleville.ca Sean Kelly Member Since: December 2018 Telephone: 343-645-4630 Email: councillor.kelly@belleville.ca Kelly Henderson (McCaw) Member Since: June 2025 Telephone: 343-645-4628 Email: councillor.henderson@belleville.ca Margaret Seu Member Since: October 2024 Telephone: 613-849-5389 Email: councillor.seu@belleville.ca Garnet Thompson Member Since: February 2006 Telephone: 613-920-3642 Email: councillor.thompson@belleville.ca Ward 2 Councillors Kathryn Ann Brown Member Since: November 2022 Telephone: 613-920-3973 Email: councillor.brown@belleville.ca Paul Carr Member Since: December 2014 Telephone: 613-847-0645 Email: councillor.carr@belleville.ca Get In Touch Stay up-to-date Subscribe to this page to get notified when this page has updated content. Notify Me Close Search Pop Up Search I Want To... Close I Want To menu Search Close Old Browser Notification Browser Compatibility Notification It appears you are trying to access this site using an outdated browser. As a result, parts of the site may not function properly for you. We recommend updating your browser to its most recent version at your earliest convenience."
  },
  {
    "municipality": "Belleville, City of",
    "source_type": "other",
    "title": "Employment Opportunities\n        - City of Belleville",
    "date": null,
    "source_url": "http://www.belleville.ca/en/city-hall/employmentopportunities.aspx",
    "text": "Close Alert Banner Employment Opportunities Decrease text size Default text size Increase text size Print This Page Share This Page Facebook Twitter LinkedIn Email Menu Click the link below to open up our job board. See Jobs! Get In Touch Stay up-to-date Subscribe to this page to get notified when this page has updated content. Notify Me Close Search Pop Up Search I Want To... Close I Want To menu Search Close Old Browser Notification Browser Compatibility Notification It appears you are trying to access this site using an outdated browser. As a result, parts of the site may not function properly for you. We recommend updating your browser to its most recent version at your earliest convenience."
  },
  {
    "municipality": "Belleville, City of",
    "source_type": "other",
    "title": "Freedom of Information\n        - City of Belleville",
    "date": null,
    "source_url": "http://www.belleville.ca/en/city-hall/freedom-of-information.aspx?_mid_=41336",
    "text": "Close Alert Banner Freedom of Information Decrease text size Default text size Increase text size Print This Page Share This Page Facebook Twitter LinkedIn Email Menu All requests made under the Municipal Freedom of Information and Protection of Privacy Act (The Act) must be made in writing and be accompanied by a $5 application fee. The Act provides a right of access to records held by the municipality however, the general right of access is limited by certain exemptions that are in place to protect one's right for privacy and the needs of the institution. Make an FOI request For more information about making a request please contact the Deputy City Clerk's Department at 613-967-3200 ext. 3254 Fees There is a $5 fee to make a request and this initial fee must be received before we start processing you request. You can pay in person by cash, debit, credit card or cheque (payable to The City of Belleville). As well you can mail in your request along with a $5 cheque. Additional charges may apply for searching and preparing records for disclosure. You will be provided with a fee estimate in cases where charges will be more than $25. If the estimate is over $100, you will need to pay a 50% deposit before we start your request. Common charges include: Searching for records is $7.50 per 15 minutes Preparing records for disclosure is $7.50 per 15 minutes Photocopies are $0.20 per page Formulating your request All requests should clearly state exactly what information is required. Requests for information should clearly describe the records being sought. If you request “any or all information,” all City Departments must initiate a search of all records under their control. When every department is involved in a search for records, the cost for processing the request can increase quickly. To avoid costly fees, we encourage you to make your request as specific as possible. Submit your Request for Information Form Appeal process If you are not satisfied with the decision regarding your request, you may file an appeal with the Information and Privacy Commission (IPC) within 30 days of receiving the decision. The appeal fee is $25, which you must pay to the Information and Privacy Commissioner of Ontario (IPC). For more information about filing an appeal go to the IPC website. Get In Touch Stay up-to-date Subscribe to this page to get notified when this page has updated content. Notify Me Close Search Pop Up Search I Want To... Close I Want To menu Search Close Old Browser Notification Browser Compatibility Notification It appears you are trying to access this site using an outdated browser. As a result, parts of the site may not function properly for you. We recommend updating your browser to its most recent version at your earliest convenience."
  },
  {
    "municipality": "Belleville, City of",
    "source_type": "council",
    "title": "Housing Initiatives\n        - City of Belleville",
    "date": null,
    "source_url": "http://www.belleville.ca/en/city-hall/housing-initiatives.aspx?_mid_=118145",
    "text": "Close Alert Banner Housing Initiatives Decrease text size Default text size Increase text size Print This Page Share This Page Facebook Twitter LinkedIn Email Menu Track housing progress in Belleville with our new Development Tracker!Development Tracker Housing Accelerator Fund The City of Belleville remains committed to increasing the housing supply and addressing the dire need for affordable options for residents. In February 2025, Belleville received $10.5 million in funding through the second round of the federal Housing Accelerator Fund. This funding agreement was put in place to accelerate the construction of 259 homes over the next three years (10,540 homes over the next decade) by eliminating barriers to building housing faster. The application included eight initiatives under the City of Belleville’s action plan: Encourage alternative housing solutions for sustainable living Develop city-owned lands for housing to create rental and affordable housing units As-of-right permissions for missing-middle housing options Enhance zoning provisions to enable a diverse housing supply. Refresh the City’s Community Improvement Plan with additional affordable housing and missing middle programs Expand residential development opportunities through policy updates Streamline and enhance the development approval process for missing-middle and affordable housing Identify municipal infrastructure needs to enable additional development potential The eight initiatives will result in systemic planning changes and unlock thousands of potential units over the next 10 years. Housing Accelerator Fund Updates Official Plan Update The City has initiated an Official Plan Update to strengthen policies as it relates to promoting the integration of missing middle housing, supporting appropriate intensification, and enabling a framework to promote higher densities in built-up areas. Community Improvement Plan (CIP) Update The City has initiated an update to the Community Improvement Plan (CIP) to consolidate and remove redundant programs and develop new programs to assist the City in reaching the Housing Accelerator Fund and Building Faster Fund targets. Pre-reviewed Detached Accessory Dwelling Unit Building Plans The City of Belleville will be putting a Call to Action to local building designers to submit their designs to be included in the City’s catalogue of pre-reviewed detached accessory dwelling unit building plans. The goal is to streamline the process by connecting landowners with building designers, and incentivizing plans to be available to the public at a reduced cost. The pre-reviewed plans will offer faster, easier and more predictability through the permitting process, as the plans will be reviewed for Ontario Building Code compliance. In addition to the Call to Action for local designs, the federal government’s Housing Design Catalogue provides readily available standardized building plans for free use, making homebuilding easier. Note: Readily available building plans do not imply Zoning By-law compliance. A plot plan will be required as part of a building permit submission. Housing Needs Assessment Through the renewed Canada Community-Building Fund (CCBF), municipalities with a population of 30,000 or greater must complete a Housing Needs Assessment (HNA) to be eligible for funding under federal infrastructure programs. Additionally, all successful Housing Accelerator Fund municipalities must complete an HNA. The City of Belleville engaged Watson & Associates Economists Ltd. to complete the assessment to evaluate current and projected housing needs in the City. On May 26, 2025, the report was received by Council. Request a copy of the City’s Housing Needs Assessment (May 2025). Accessory Dwelling Unit Rebates On May 12, 2025, the City’s Community Improvement Plan was updated with two enhanced rebates for homeowners interested in creating accessory dwelling units. The Accessory Dwelling Units in New Housing Rebate will provide home buyers who include accessory dwelling units in a newly built home with a $5,000 rebate per unit (e.g. $10,000 for two units). The Accessory Dwelling Units in Existing Housing and Detached Accessory Buildings Rebate will provide property owners who create accessory dwelling units on their property with a $5,000 rebate per unit. Funds are available on a first-come, first-served basis. Eligibility requirements apply. For more information, visit: belleville.ca/ADU Four Units As-Of-Right On March 10, 2025, Council approved four units as-of-right through the City’s Residential Intensification Project. The project included various forms of intensification within the City including: Corridor intensification; Four units as-of-right through accessory dwelling units; and Four units as-of-right through additional main use permissions (four-unit dwellings) Planning Application E-Permitting System (CityView) On February 10, 2025, the City of Belleville successfully implemented a new e-permitting system (CityView)to receive planning applications. The launch of CityView involved tremendous coordination between departments, cataloguing and verifying historical data. Development Tracker On Sept. 2, 2025, the City of Belleville introduced a new Development Tracker. This user-friendly application allows users to view current residential development projects throughout the city and their status. The Development Tracker includes several innovative features to track housing progress, explore new subdivisions and view all active development applications (e.g. rezonings, minor variances, site plans, etc.), including: Subdivision Tracker – An interactive map detailing the approval and construction status of subdivisions. The tracker includes a custom list widget that dynamically displays subdivision and phase-level data, such as total building capacity by housing type and the amount of remaining vacant land. Housing Construction – An interactive map that tracks building permits and housing growth targets dating back to 2021. Connected directly to the City’s permitting system, it allows real-time analysis of building activity. Custom filters let users explore data by status and year, offering insights into progress toward the Housing Accelerator Fund and Build Faster Fund targets. Data is updated regularly to ensure accuracy and reliability. Development Applications – An existing interactive map that tracks current development proposals has now been integrated into the centralized Development Tracker. This tool allows residents and staff to filter, query and view active applications. Residential Land Supply – Reporting on land use demand, supply, development and infrastructure. Get In Touch Stay up-to-date Subscribe to this page to get notified when this page has updated content. Notify Me Close Search Pop Up Search I Want To... Close I Want To menu Search Close Old Browser Notification Browser Compatibility Notification It appears you are trying to access this site using an outdated browser. As a result, parts of the site may not function properly for you. We recommend updating your browser to its most recent version at your earliest convenience."
  },
  {
    "municipality": "Belleville, City of",
    "source_type": "council",
    "title": "Mayors Office\n        - City of Belleville",
    "date": null,
    "source_url": "http://www.belleville.ca/en/city-hall/mayors-office.aspx?_mid_=65178",
    "text": "Close Alert Banner Mayor's Office Decrease text size Default text size Increase text size Print This Page Share This Page Facebook Twitter LinkedIn Email Menu Neil Ellis is the 77th Mayor of the City of Belleville. Neil was elected Mayor on October 24, 2022. Born and raised in Belleville, Neil is first and foremost a loving husband to Susan, and the proud father of Zachary, Maddison and Abigail. Neil has deep roots in the community. He owned and operated Doug’s Bicycle for nearly 30 years. From 2006-2014, Neil served as Mayor of the City of Belleville. He proved to be a visionary leader who championed physician recruitment and infrastructure improvements, believing such investments to be a precursor to economic growth and an improved quality of life for all citizens. During his two terms as Mayor, Neil quickly came to realize that federal leadership is key to securing the stable funding needed for municipal infrastructure development and service delivery. This prompted him to run for federal office, and in 2015 Neil was elected as the first Member of Parliament for the Bay of Quinte riding. For the next four years, he served as Chair of the Standing Committee on Veterans Affairs. Upon re-election in 2019, Neil was named Parliamentary Secretary to the Minister of Agriculture and Agri-Food. Neil has extensive knowledge of Belleville and the surrounding area, and has built strong working relationships with business leaders, elected officials from all levels of government, and community stakeholders. He is a well-respected leader who has earned a reputation for being approachable. Neil welcomes the opinions of others, and is committed to teamwork and collaboration. Neil is an experienced candidate with a proven commitment to the principles of good governance. He has earned a Bachelor of Arts degree in Law and Psychology from Carleton University, and professional designations through McMaster University’s Directors College Executive program. As the Mayor of the City of Belleville, he believes that decisions made by municipal government most directly affect the daily lives of citizens, and this is his greatest passion. Contact Information NameTitlePhoneEmail Neil Ellis Mayor 613-967-3267 mayor.ellis@belleville.ca Sarah Tummon-Button Manager of Mayor and Council Services & Communications 613-967-3215 stummon-button@belleville.ca Angela Forestell Administrative Coordinator 613-967-3200 ext. 3538 aforestell@belleville.ca Katelyn Robinson Special Projects Coordinator 613-967-3200 ext. 3251 tspencer@belleville.ca Jenna Leslie Web & Engagement Specialist 613-967-3200 ext. 3261 jleslie@belleville.ca Caleb Sayer Communications & Content Specialist 613-847-7068 csayer@belleville.ca Kelsey Keledjian Communications & Media Specialist 613-967-3200 ext. 3279 kkeledjian@belleville.ca Get In Touch City Hall 169 Front StreetBelleville, Ontario K8N 2Y8Phone: 613-968-6481TTY: 613-967-3768communications@belleville.caReport an IssueReport an Accessibility Concern Stay up-to-date Subscribe to this page to get notified when this page has updated content. Notify Me Close Search Pop Up Search I Want To... Close I Want To menu Search Close Old Browser Notification Browser Compatibility Notification It appears you are trying to access this site using an outdated browser. As a result, parts of the site may not function properly for you. We recommend updating your browser to its most recent version at your earliest convenience."
  },
  {
    "municipality": "Belleville, City of",
    "source_type": "council",
    "title": "Municipal Election\n        - City of Belleville",
    "date": null,
    "source_url": "http://www.belleville.ca/en/city-hall/municipal-election.aspx",
    "text": "Close Alert Banner Municipal Election Decrease text size Default text size Increase text size Print This Page Share This Page Facebook Twitter LinkedIn Email Menu 2026 Municipal Election The next Belleville municipal election will be held on Monday, Oct. 26, 2026. Nominations for the next municipal election open on Friday, May 1, 2026. Voters will be able to cast their ballots through Internet or Telephone Voting. In addition, paper ballots will be available at the Voter Assistance Centres prior to Election Day on Oct. 26, 2026. Information for Voters Elections Ontario is responsible for maintaining the Permanent Register of Electors for Ontario, commonly known as the Voters' List. In order to vote in an upcoming Municipal or Provincial Election, you must be on the Voters' List. Confirm, update or add your information through Election Ontario's RegisterToVoteON.ca. Your name must be on the Voters' List in order to cast a ballot. Updating Your School Support The Municipal Property Assessment Corporation (MPAC) is legislatively required to collect school support information. You can update your school support designation through MPAC's Online School Support Designation. Information for Candidates The Association of Municipalities of Ontario (AMO) is offering a series of free workshops for people thinking about running for municipal office in the October 2026 elections: Supporting Local Leadership in run up to the 2026 Municipal Elections Running for Municipal Office – Everything You Need to Know as an Underrepresented Candidate AMO has also developed Lead Where You Live – A Guide to Running for Municipal Council for anyone considering running in the 2026 municipal election. The guide walks you through what municipal councils do, what it means to serve your community, and the steps involved in launching a successful campaign. Get In Touch Stay up-to-date Subscribe to this page to get notified when this page has updated content. Notify Me Close Search Pop Up Search I Want To... Close I Want To menu Search Close Old Browser Notification Browser Compatibility Notification It appears you are trying to access this site using an outdated browser. As a result, parts of the site may not function properly for you. We recommend updating your browser to its most recent version at your earliest convenience."
  },
  {
    "municipality": "Belleville, City of",
    "source_type": "council",
    "title": "Oaths and Affidavits\n        - City of Belleville",
    "date": null,
    "source_url": "http://www.belleville.ca/en/city-hall/oaths-and-affidavits.aspx",
    "text": "Close Alert Banner Oaths and Affidavits Decrease text size Default text size Increase text size Print This Page Share This Page Facebook Twitter LinkedIn Email Menu Please note that an appointment is required to see a Commissioner. Contact Town Hall at 613-968-6481 to inquire about appointment availability. Commissioner of Oaths Services The fee is $30 per document. A Commissioner of Oaths, also known as a Commissioner for Taking Affidavits, is not the same as a Notary Public. A Notary Public has much broader authority. If your document requires the signature of a Notary Public, or you require certified copies of documents, then you will need to contact a lawyer or a Notary. The person signing the affidavit must appear before the Commissioner and must show proof of identity via Government issued photo identification such as a driver’s licence, or passport. The person signing the affidavit must sign the document in the presence of the Commissioner. There is no guarantee that a document can be commissioned until the document is seen by the Commissioner. The Commissioner cannot witness documents where there is a requirement to personally know the person for a certain length of time, ie. Passport Guarantor. Documents the City will Commission (including but not limited to): City of Belleville generated documents Domestic and Foreign Pension document also known as Proof of Life Delayed Statement of Live Birth Adult Name Change Vehicle transfer of ownership to a family member Statutory Declaration for OSAP – Statement of Common Law Status/Supporting Children Amendment to Birth/ Death/ Marriage Certificate forms Affidavit of Proof of Loss of Motor Vehicle/boat (from an insurance company) Affidavit of Proof of Residency Travel Industry Council of Ontario - Affidavit of Customer Claimant Documents the City cannot Commission: Wills, Living Wills, Codicils to Wills or Estate Settlement documents Power of Attorney Divorce, separation, marriage or cohabitation documents Custody documents Documents related to debt Real Estate documents Court, Legal or Civil issue related documents Declaration or Claimant and Indemnity Statutory Declaration of Progress Payment Distribution – Holdback Security Deposits Statement of Arrears Declaration of a Translator Age of Majority or BYID Card Application Documents requiring the signature of a Notary Public, Canadian and Foreign Get In Touch Stay up-to-date Subscribe to this page to get notified when this page has updated content. Notify Me Close Search Pop Up Search I Want To... Close I Want To menu Search Close Old Browser Notification Browser Compatibility Notification It appears you are trying to access this site using an outdated browser. As a result, parts of the site may not function properly for you. We recommend updating your browser to its most recent version at your earliest convenience."
  },
  {
    "municipality": "Belleville, City of",
    "source_type": "council",
    "title": "Proclamations and Lighting\n        - City of Belleville",
    "date": null,
    "source_url": "http://www.belleville.ca/en/city-hall/proclamations-and-lighting.aspx",
    "text": "Close Alert Banner Proclamations and Lighting Decrease text size Default text size Increase text size Print This Page Share This Page Facebook Twitter LinkedIn Email Menu Proclamations A proclamation is an official announcement or declaration made by the Mayor and/or Council to recognize an important matter. Proclamations may be issued for various special events, occasions or issues and serve as a public education and awareness piece. All requests for proclamations at the City of Belleville must first come through the Mayor's Office. The request is then processed, reviewed by the Mayor and if approved, made at a Belleville City Council meeting. Flag Raisings Flag raisings are available for causes in our community that are able to provide their own flags to be raised. The flag will be raised for the period of one month at a time at the Quinte Sports and Wellness Centre. Flag raisings are only available April through November and are weather dependent. A small gathering for the initial raising may be possible and staff will provide you with information for this after your request form below is received. Lighting Requests Lighting requests come through the Mayor's Office and are reviewed and/or approved by the Mayor. If approved, staff will schedule the lighting of the Bridge Street Bridge, Fire Station 1 Memorial and the BELLEVILLE sign for the preferred timeline and colours. Messaging may also be displayed on promotional signage at the Quinte Sports & Wellness Centre and West Zwick's Park. Please note, requests must be submitted no less than three months prior to the requested date. Requests are received on a first-come-first-served-basis. In the event of multiple requests during one time period, every effort will be made to honour all requests. Status of requests may be changed by staff at any time as required by urgent matters. Proclamation, Flag Raising and/or Lighting Request Form 2026 Proclamations The following are previous proclamations the City of Belleville has declared at the request of community organizations. January Alzheimer Awareness Month Event Date: Month of January Lighting Colour: Blue Details: https://alzheimer.ca/en/about-dementia/stigma-against-dementia/alzheimers-awareness-month 150th Anniversary of the Founding of the Belleville Garden Club Event Date: Jan. 5 Lighting Colour: Blue Details: https://bellevillegardenclub.ca/ Bell Let's Talk Event Date: Jan. 21 Lighting Colour: Blue Details: https://letstalk.bell.ca/ Get In Touch Stay up-to-date Subscribe to this page to get notified when this page has updated content. Notify Me Close Search Pop Up Search I Want To... Close I Want To menu Search Close Old Browser Notification Browser Compatibility Notification It appears you are trying to access this site using an outdated browser. As a result, parts of the site may not function properly for you. We recommend updating your browser to its most recent version at your earliest convenience."
  },
  {
    "municipality": "Belleville, City of",
    "source_type": "council",
    "title": "Proclamations and Lighting\n        - City of Belleville",
    "date": null,
    "source_url": "http://www.belleville.ca/en/city-hall/proclamations-and-lighting.aspx?_mid_=106753",
    "text": "Close Alert Banner Proclamations and Lighting Decrease text size Default text size Increase text size Print This Page Share This Page Facebook Twitter LinkedIn Email Menu Proclamations A proclamation is an official announcement or declaration made by the Mayor and/or Council to recognize an important matter. Proclamations may be issued for various special events, occasions or issues and serve as a public education and awareness piece. All requests for proclamations at the City of Belleville must first come through the Mayor's Office. The request is then processed, reviewed by the Mayor and if approved, made at a Belleville City Council meeting. Flag Raisings Flag raisings are available for causes in our community that are able to provide their own flags to be raised. The flag will be raised for the period of one month at a time at the Quinte Sports and Wellness Centre. Flag raisings are only available April through November and are weather dependent. A small gathering for the initial raising may be possible and staff will provide you with information for this after your request form below is received. Lighting Requests Lighting requests come through the Mayor's Office and are reviewed and/or approved by the Mayor. If approved, staff will schedule the lighting of the Bridge Street Bridge, Fire Station 1 Memorial and the BELLEVILLE sign for the preferred timeline and colours. Messaging may also be displayed on promotional signage at the Quinte Sports & Wellness Centre and West Zwick's Park. Please note, requests must be submitted no less than three months prior to the requested date. Requests are received on a first-come-first-served-basis. In the event of multiple requests during one time period, every effort will be made to honour all requests. Status of requests may be changed by staff at any time as required by urgent matters. Proclamation, Flag Raising and/or Lighting Request Form 2026 Proclamations The following are previous proclamations the City of Belleville has declared at the request of community organizations. January Alzheimer Awareness Month Event Date: Month of January Lighting Colour: Blue Details: https://alzheimer.ca/en/about-dementia/stigma-against-dementia/alzheimers-awareness-month 150th Anniversary of the Founding of the Belleville Garden Club Event Date: Jan. 5 Lighting Colour: Blue Details: https://bellevillegardenclub.ca/ Bell Let's Talk Event Date: Jan. 21 Lighting Colour: Blue Details: https://letstalk.bell.ca/ Get In Touch Stay up-to-date Subscribe to this page to get notified when this page has updated content. Notify Me Close Search Pop Up Search I Want To... Close I Want To menu Search Close Old Browser Notification Browser Compatibility Notification It appears you are trying to access this site using an outdated browser. As a result, parts of the site may not function properly for you. We recommend updating your browser to its most recent version at your earliest convenience."
  },
  {
    "municipality": "Belleville, City of",
    "source_type": "council",
    "title": "Proclamations and Lighting\n        - City of Belleville",
    "date": null,
    "source_url": "http://www.belleville.ca/en/city-hall/proclamations-and-lighting.aspx?_mid_=106623",
    "text": "Close Alert Banner Proclamations and Lighting Decrease text size Default text size Increase text size Print This Page Share This Page Facebook Twitter LinkedIn Email Menu Proclamations A proclamation is an official announcement or declaration made by the Mayor and/or Council to recognize an important matter. Proclamations may be issued for various special events, occasions or issues and serve as a public education and awareness piece. All requests for proclamations at the City of Belleville must first come through the Mayor's Office. The request is then processed, reviewed by the Mayor and if approved, made at a Belleville City Council meeting. Flag Raisings Flag raisings are available for causes in our community that are able to provide their own flags to be raised. The flag will be raised for the period of one month at a time at the Quinte Sports and Wellness Centre. Flag raisings are only available April through November and are weather dependent. A small gathering for the initial raising may be possible and staff will provide you with information for this after your request form below is received. Lighting Requests Lighting requests come through the Mayor's Office and are reviewed and/or approved by the Mayor. If approved, staff will schedule the lighting of the Bridge Street Bridge, Fire Station 1 Memorial and the BELLEVILLE sign for the preferred timeline and colours. Messaging may also be displayed on promotional signage at the Quinte Sports & Wellness Centre and West Zwick's Park. Please note, requests must be submitted no less than three months prior to the requested date. Requests are received on a first-come-first-served-basis. In the event of multiple requests during one time period, every effort will be made to honour all requests. Status of requests may be changed by staff at any time as required by urgent matters. Proclamation, Flag Raising and/or Lighting Request Form 2026 Proclamations The following are previous proclamations the City of Belleville has declared at the request of community organizations. January Alzheimer Awareness Month Event Date: Month of January Lighting Colour: Blue Details: https://alzheimer.ca/en/about-dementia/stigma-against-dementia/alzheimers-awareness-month 150th Anniversary of the Founding of the Belleville Garden Club Event Date: Jan. 5 Lighting Colour: Blue Details: https://bellevillegardenclub.ca/ Bell Let's Talk Event Date: Jan. 21 Lighting Colour: Blue Details: https://letstalk.bell.ca/ Get In Touch Stay up-to-date Subscribe to this page to get notified when this page has updated content. Notify Me Close Search Pop Up Search I Want To... Close I Want To menu Search Close Old Browser Notification Browser Compatibility Notification It appears you are trying to access this site using an outdated browser. As a result, parts of the site may not function properly for you. We recommend updating your browser to its most recent version at your earliest convenience."
  },
  {
    "municipality": "Belleville, City of",
    "source_type": "council",
    "title": "User Fees Study\n        - City of Belleville",
    "date": null,
    "source_url": "http://www.belleville.ca/en/city-hall/user-fees-study.aspx",
    "text": "Close Alert Banner User Fees Study Decrease text size Default text size Increase text size Print This Page Share This Page Facebook Twitter LinkedIn Email Menu Learn more about the User Fees Study Project. Final User Fees Study Draft User Fees Study Questions received from Public Survey Project Start-up in 2023 Final User Fees Study The Final User Fees Study including the public survey comments went to Council on September 23: Meeting Agenda and Agenda Package. The following recommendation was approved: \"That pursuant to the Director of Community Services Report No. DCSD-2024-07, City of Belleville 2024 User Fees Study be approved; and That the Director's recommendations be approved for implementation, including the preparation of amendments to the Consolidated Fees and Charges By-Law for Council's consideration to implement the recommended user fee increases for 2025.\" The Director's recommendations, included: Approval of the City of Belleville 2024 User Fees Study Approval of the draft City of Belleville User Fees Policy Approval of the Increases to User Fees based on Option 2 - Reduced Impact Refer costs associated with field lining to the 2025 Capital and Operating Budgets for Council's consideration with a proposed rate change that considers these increases levels of services and costs. City staff to continue to evaluate additional revenue generating opportunities for future Council consideration. Some Examples of the Proposed New User Fees (Option 2) Service Area/Fee Example2025 Estimated Total Operating Cost2025 Proposed User Fee2025 Proposed City Cost (collected from taxes)Projected % of Revenue Recovered From UsersProjected % of Revenue Recovered From Taxes QSWC Registration Programs - Adult Fitness/Programs - hourly rate $28.75 $9.00 $19.75 31% 69% QSWC Registration Programs - Day Camp/Summer Camp $128.58 $39.25 $89.33 31% 69% QSWC Indoor Aquatics - Lane Rentals – hourly rate $72.50 $18.25 $54.25 25% 75% QSWC Arenas - Ice Rentals - Prime Time Adult $823 $200.75 $622.25 24% 76% QSWC Arenas - Ice Rentals - Prime Minor Sports $823.00 $174.50 $648.50 21% 79% QSWC Leases/Space Rentals - Floor Rental – Adults - hourly rate $456.50 $98.25 $358.25 22% 78% QSWC Senior's Active Living Centre - Older Adult Yoga Classes - hourly rate $15.50 $7.75 $7.75 50% 50% Outdoor Aquatics - Kinsmen Pool – Whole Pool Rental $544.25 $148.75 $395.50 27% 73% Communtiy Centres - Parkdale Community Centre rental - hourly rate $61.50 $46.75 $14.75 76% 24% Harbours - Meyers Pier - Seasonal Mooring - per foot of boat $91.07 $57.50 $33.57 63% 37% Archives - Scanning images - per image $10 $5.25 $4.75 53% 48% Glanmore Museum - General Admission $77.27 $8.50 $68.77 11% 89% * Based on projections outlined in the User Fees Study and Option 2 - Reduced Impact as outlined in the User Fees Study Report dated September 23, 2024 and subject to change upon adoption of the 2025 Operating Budget. **Except Glanmore and Archives, HST is not included Draft User Fees Study The User Fees Study - Draft is available for public viewing. It is a requirement for the City of Belleville to provide an AODA compliant version if requested. The objective of the User Fees Study was to assess the City’s funding approach for parks, recreation and culture programs and services, including how it should balance taxation-funded subsidization with revenue generated through user fees. The study includes a comprehensive cost and revenue analysis, benchmarking against comparator municipalities, recommended rate increases and a draft User Fees Policy for guiding future decision-making regarding fees. Questions received from the Draft User Fees Study Survey Thank you for submitting your questions as part of the public survey. Below are the questions received and the corresponding answers. General Question 1 - What do the taxes we pay go towards? Answer 1 - Here is the link to the City’s budget page which provides information on both operating and capital budgets and taxes. https://www.belleville.ca/en/city-hall/operating-budget-101.aspx Question 2 - How much city tax payer money was spent conducting this study? Answer 2 - The consultant (StrategyCorp Inc) was contracted to conduct the review in the amount of $50,000. Question 3 - What services are being increased to match the increased fees? Answer 3 - At this time, the current fees being charged do not cover the full costs of the programs and services offered by the City. The report outlines the current cost recovery percentages and the targets. Harbours Question 1- With these drastic fee increases, can we expect significant facility improvements including security. Thank you for requesting my input. Answer 1 - At this time, the current fees being charged do not cover the full costs of the programs and services offered by the City. The report outlines the current cost recovery percentages and the targets. Furthermore, the City has invested hundreds of thousands of dollars in recent years to renew the docks and pedestals. Question 2 - Will the sliding scale of cost recovery be revisited by council? Will the increase in harbor fees be scaled back and implemented at a more reasonable rate? Answer 2 - A report will go forward to Council on September 23 outlining the various options available. Question 3 - Is there a document which outlines the capital expenditure plans for Victoria Park Harbour? If so I would like to read it. Answer 3 - The City is in the process of developing a 10-Year Capital Plan for all Facility assets. As part of the current Asset Management Plan, condition assessments are being completed on all facilities and associated components which will help provide direction once finalized on the expected expenditures for the facilities. The capital expenditures in this study represent the average annual investment needed to support the capital projects required to maintain current service levels at the City’s harbours. This annualization approach aligns with standard municipal asset management practices, ensuring a strategy is considered to fund these expenditures over the long-term planning period. Capital budgets are approved annually by Council, and investments in specific service areas may fluctuate from year to year. The annualized investment helps accommodate potential spikes in spending throughout the planning period. For more information, the City’s 2024 Asset Management Plan can be requested at https://forms.belleville.ca/Do-Business/Growth-Management/Asset-Management-Plan Question 4 - Please explain or describe the $825,900 Capitol expenditure for Harbours in 2024? Answer 4 - The capital expenditures in this study represent the average annual investment needed to support the capital projects required to maintain current service levels at the City’s harbours. This annualization approach aligns with standard municipal asset management practices, ensuring a strategy is considered to fund these expenditures over the long-term planning period. Capital budgets are approved annually by Council, and investments in specific service areas may fluctuate from year to year. The annualized investment helps accommodate potential spikes in spending throughout the planning period. For more information, the City’s 2024 Asset Management Plan can be requested at https://forms.belleville.ca/Do-Business/Growth-Management/Asset-Management-Plan Question 5 - In other city run programs there is an extra surcharge for on tax paying residences, why is that not enforced at the marinas ? Answer 5 - At this time, the City does not charge different rates for residents and non-residents. For program registrations we do allow City Taxpayers/Residents to register before Non City Taxpayers/Residents (by four days) but the rates are the same. More than 66% of the seasonal slips at our marinas are currently booked by Belleville residents while an additional 15% live just outside of Belleville. Question 6 - I would like to know why the excessive increase in fees when i have no access to hydro and i have paid for it on my dock. Answer 6 - At this time, the current fees being charged do not cover the full costs of the operation of the marinas. The report outlines the current cost recovery percentages and the targets. Question 7 - How do you justify the increase for Victoria Harbour given its short comings? Answer 7 - At this time, the current fees being charged do not cover the full costs of the operation of the marinas. The report outlines the current cost recovery percentages and the targets. Furthermore, the City has invested hundreds of thousands of dollars in recent years to renew the docks and is considering additional investments during the 2025 Capital Budget process. Question 8 - I am interested in what is included in the mtc and operating costs for the Harbour (ie does it include the mtc, water, mtc for the Pier bar? it should not, Does it include the Hill green space (public space) and all the water pumps/ electricity etc that run there. I would also like to understand what is in the 2024 Capital 825,900 costs, and if it includes anything to do with the pier itself (had to have fences this year because it is crumbling) .This is public space... not boater space. Also the Cost of 85 per foot that was calculated, does that include electricity? because we pay for slip/foot and electricity separately... so when I calculate out the 22% increase, my actual cost per foot would be around $72 not 63. Answer 8 - The capital expenditures in this study represent the average annual investment needed to support the capital projects required to maintain current service levels at the City’s harbours. This annualization approach aligns with standard municipal asset management practices, ensuring a strategy is considered to fund these expenditures over the long-term planning period. Capital budgets are approved annually by Council, and investments in specific service areas may fluctuate from year to year. The annualized investment helps accommodate potential spikes in spending throughout the planning period. For more information, the City’s 2024 Asset Management Plan can be requested at https://forms.belleville.ca/Do-Business/Growth-Management/Asset-Management-Plan. Furthermore, the City has invested hundreds of thousands of dollars in recent years to renew the docks and is considering additional investments during the 2025 Capital Budget process. But, as highlighted in the User Fees Study, the current dockage fees being charged do not cover the full costs of the operation of the marinas. The Community Services Department continues to review and refine the Harbours budget to ensure marina and waterfront expenses are separated. Question 9 - What is the projected end state for rapid rate increases to harbour rentals? Answer 9 - The User Fees Study recommendations include one-time fee increases in 2025 and 2026 with inflationary/market increases thereafter. Sports Fields Question 1 - Why are all youth and adult Belleville programs paying the same cost to rent the fields as outside users when every other city charges them more? Answer 1 - Many municipalities including Belleville do not have resident and non resident fees. This is something that will be explored by City staff as part of the consultant’s recommendations. Recreation Programs Question 1 - Will the city entertain memberships vice pay per use? Answer 1 - The facility is not set up to offer traditional memberships as many of our spaces are used for both programming and rentals. Where feasible we have introduced session passes and will continue to explore these options. Question 2 - Will staff consider offering an annual pass for residents to use the pool for lane swims? Other municipalities across Ontario currently do. What happened to the Wellness Passport? Will it be considered again? Why is it free and open for anyone to use the indoor track for example? Why not offer the Passport for City residents to access the track and other parts of the QSWC, but if say a resident of Prince Edward County, Tweed or Napanee wants to have a Passport, they pay $20 per year, or some other determined amount? Make those who come for swim meets and hockey tournaments from outside our region have to pay to use the walking track. Otherwise right now they can use it for free and that's extra wear that City taxpayers have to help pay for. Also, can the City offer an online booking system (especially for ice rentals) like what's offered by the City of Quinte West? Answer 2 - The facility is not set up to offer traditional memberships as many of our spaces are used for both programming and rentals. Where feasible we have introduced session passes and will continue to explore these options. At this time we do not have a different rate for non-City residents and taxpayers but this is something City staff will be reviewing as per the consultant’s recommendations. The FDC Indoor Track is free of charge. When the building was built, the track was an important feature providing all spectators and participants with an opportunity to walk/run while at the facility. The City has an online booking system for recreation programs and offers a facility request form for rentals. City staff will explore online booking viewing for last minute booking opportunities. Question 3 - Is it possible to lover the senior age to 60? Many seniors are on fixed incomes that prevent access to many programs. Answer 3 - Our Older Adult age is 50+ for our 50+ Centre and older adult programming. Question 4 - Is it possible to lover the senior age to 60? Many seniors are on fixed incomes that prevent access to many programs. Answer 4 - Our Older Adult age is 50+ for our 50+ Centre and older adult programming. Project Start-up in 2023 About the Project: The City of Belleville is undertaking a comprehensive user fees study. Most of the City of Belleville’s parks, recreation and culture user fees have not undergone significant review or changes in recent years. The 2023 review has included an assessment of the City’s existing user fee schedule, potential new user fees and the development of user fee-related policies. Facilities and associated fees considered in the study included: ice/floor surfaces and event fees, gymnasiums, aquatic facilities, multi-purposed spaces, playing fields, ball diamonds, parks, marina operations, community centres, museum services and more. The Approach: Strategy Corp Inc. was contracted to conduct the review which has consisted of three phases. Phase 1: Fees Analysis and Stakeholder Engagement - The project team will began by conducting a quantitative analysis of the existing fees and consulting with identified stakeholders. This included development of a stakeholder engagement plan, interview guides for relevant stakeholders and fees analysis findings report. Phase 2: User Fee Recommendations Formulation - Informed by the previous findings, the team then developed draft preliminary recommendations for revisions to the fees schedule and phased implementation planning. Phase 3: Organizational and Service Delivery Review Finalization - The final stage of the project involves a presentation of the findings to council, followed by a recommended fee schedule and policies for council approval. Strategy Corp Inc. is in the process of completing its draft report for the project team’s review. A final report with recommendations will be presented to Council. Community Engagement: We will be engaging stakeholders through a variety of mechanisms including: Interviews – Members of the project team have reached out to stakeholders to conduct interviews. Online Survey – Closed Residents are encouraged to stay tuned for future updates. Additional Information For more information regarding the City of Belleville User Fees Study, please contact the project team. Get In Touch Stay up-to-date Subscribe to this page to get notified when this page has updated content. Notify Me Close Search Pop Up Search I Want To... Close I Want To menu Search Close Old Browser Notification Browser Compatibility Notification It appears you are trying to access this site using an outdated browser. As a result, parts of the site may not function properly for you. We recommend updating your browser to its most recent version at your earliest convenience."
  },
  {
    "municipality": "Belleville, City of",
    "source_type": "other",
    "title": "RZone\n        - City of Belleville",
    "date": null,
    "source_url": "http://www.belleville.ca/en/city-hall/rzone.aspx",
    "text": "Close Alert Banner RZone Decrease text size Default text size Increase text size Print This Page Share This Page Facebook Twitter LinkedIn Email Menu The RZone is all about respect and responsibility – respect for yourself, respect for others, and responsibility for your actions. The RZone Policy is a “zero tolerance” behaviour policy which outlines measures to discourage incidents of inappropriate behaviour and to ensure that any instances are dealt with quickly, fairly and in a consistent manner. It applies to all City of Belleville facilities, properties, City-sponsored events, programs, written or verbal communications or at any other location where City staff are present. The goal is to promote a positive, safe enjoyable and supportive environment for all participants, spectators, contractors, volunteers and employees. Request a Copy of the RZone Policy Rules of Participation Here’s how you can do your part to ensure City facilities and interactions remain positive, safe, enjoyable and supportive for all: Follow the rules, regulations and by-laws Follow specific building and program rules Always demonstrate courtesy and respect to others Act in a responsible manner Respect the rights and privileges of others, including employees Respect the property of others, including City property, facilities and equipment Cooperate with City employees to maintain safety, order and discipline Agree not to engage in solicitation or lobbying activities on City property unless authorized in writing Agree not to engage in abuse, harassment and bullying behaviours Agree not to misuse the City’s wireless network or technology Take pride in keeping facilities and properties clean by picking up after yourself Follow site specific emergency procedures Report any issues to City employees immediately FAQ Where does the RZone apply? This policy applies to all participants, spectators, contractors, volunteers and employees of City facilities, properties, and programs, including but not limited to: City-owned, operated, and leased buildings and facilities, including parking lots Marinas/harbours Parks, greenspace, and trails Library City buses and other vehicles City programs and events (hosted on city/non-city owned property) Structured (permit issued) or unstructured (no permit issued) activities Interactions in the workplace (telephone, email, social media, city vehicles, worksites) What is considered “inappropriate behaviour”? Inappropriate behaviour for the purpose of this policy includes, but is not limited to the following behaviours: Aggressive or intimidating approaches to another individual (verbal assaults – raising voice/yelling/swearing) Attempts to goad or incite anger or violence in others Refusal to follow City rules, breach of policy, procedure, or by-law Vandalism to a City building, property or equipment owned or leased Theft of property Inappropriate use of technology Threats and/or attempts to intimidate Harassment (“engaging in a course of vexatious comment or conduct that is known or ought reasonably to be known to be unwelcome” as defined by the Ontario Human Rights) or bullying Racial/ethnic intolerance Throwing of articles in a deliberate or aggressive manner Racial/ethnic hate speak/actions Physical striking of another individual Smoking, vaping, consumption of illegal drugs, cannabis or alcohol Possession of weapons, tools, or anything that could reasonably be considered intimidating or dangerous What do I do if I see or experience inappropriate behaviour? Try to report any acts of inappropriate behaviour within 48 hours or as soon as possible. A report can be made in-person with a City employee, your affiliated organization or using our online form. RZone Incident Reporting Form How is a report dealt with? Individuals who engage in any inappropriate behaviour, as defined in this policy, will be subject to sanctions imposed by the RZone Enforcement Guidelines (found in Appendix A of the RZone Policy) which include: Verbal warning – a verbal warning may issued requesting that the inappropriate behaviour stop and ask the individual to leave the premises for the remainder of the day Immediate ban from premises for a period of 72 hours or less Letter of warning Written letter of reprimand followed with ban from specific facility/property (Trespass Notice) Written letter of reprimand with ban from specific facility/property plus payment of repair costs (Trespass Notice) Written letter of reprimand with ban from all City facilities/properties (Trespass Notice) Contact Belleville Police Service– depending on the incident, Belleville Police Service may be contacted Questions about the RZone? Call us 613-968-6481 Get In Touch Stay up-to-date Subscribe to this page to get notified when this page has updated content. Notify Me Close Search Pop Up Search I Want To... Close I Want To menu Search Close Old Browser Notification Browser Compatibility Notification It appears you are trying to access this site using an outdated browser. As a result, parts of the site may not function properly for you. We recommend updating your browser to its most recent version at your earliest convenience."
  },
  {
    "municipality": "Belleville, City of",
    "source_type": "other",
    "title": "Freedom of Information\n        - City of Belleville",
    "date": null,
    "source_url": "http://www.belleville.ca/en/city-hall/freedom-of-information.aspx",
    "text": "Close Alert Banner Freedom of Information Decrease text size Default text size Increase text size Print This Page Share This Page Facebook Twitter LinkedIn Email Menu All requests made under the Municipal Freedom of Information and Protection of Privacy Act (The Act) must be made in writing and be accompanied by a $5 application fee. The Act provides a right of access to records held by the municipality however, the general right of access is limited by certain exemptions that are in place to protect one's right for privacy and the needs of the institution. Make an FOI request For more information about making a request please contact the Deputy City Clerk's Department at 613-967-3200 ext. 3254 Fees There is a $5 fee to make a request and this initial fee must be received before we start processing you request. You can pay in person by cash, debit, credit card or cheque (payable to The City of Belleville). As well you can mail in your request along with a $5 cheque. Additional charges may apply for searching and preparing records for disclosure. You will be provided with a fee estimate in cases where charges will be more than $25. If the estimate is over $100, you will need to pay a 50% deposit before we start your request. Common charges include: Searching for records is $7.50 per 15 minutes Preparing records for disclosure is $7.50 per 15 minutes Photocopies are $0.20 per page Formulating your request All requests should clearly state exactly what information is required. Requests for information should clearly describe the records being sought. If you request “any or all information,” all City Departments must initiate a search of all records under their control. When every department is involved in a search for records, the cost for processing the request can increase quickly. To avoid costly fees, we encourage you to make your request as specific as possible. Submit your Request for Information Form Appeal process If you are not satisfied with the decision regarding your request, you may file an appeal with the Information and Privacy Commission (IPC) within 30 days of receiving the decision. The appeal fee is $25, which you must pay to the Information and Privacy Commissioner of Ontario (IPC). For more information about filing an appeal go to the IPC website. Get In Touch Stay up-to-date Subscribe to this page to get notified when this page has updated content. Notify Me Close Search Pop Up Search I Want To... Close I Want To menu Search Close Old Browser Notification Browser Compatibility Notification It appears you are trying to access this site using an outdated browser. As a result, parts of the site may not function properly for you. We recommend updating your browser to its most recent version at your earliest convenience."
  },
  {
    "municipality": "Belleville, City of",
    "source_type": "council",
    "title": "Terms of Use\n        - City of Belleville",
    "date": null,
    "source_url": "http://www.belleville.ca/en/city-hall/terms-of-use.aspx",
    "text": "Close Alert Banner Terms of Use Decrease text size Default text size Increase text size Print This Page Share This Page Facebook Twitter LinkedIn Email Menu The Terms of Use relate to the City of Belleville's online sites, including but not limited to the City's: Corporate website, https://www.belleville.ca/ and its related webpages (including any Online Services), https://quintesportsandwellnesscentre.ca/, http://glanmore.ca/, http://cabhc.ca/ and, Corporate social media accounts, including but not limited to Twitter, Facebook, YouTube, Instagram and LinkedIn. The access and use of these \"online sites\" is subject to the terms and conditions listed below. Privacy Policy Protecting the privacy and personal information of individuals is an important consideration in the way we structure our online and offline activities. When visiting our websites there is no requirement to identify yourself. The City's privacy policy applies only to those sites operated by the City of Belleville. The City does not control the privacy practices of external sites. Before submitting personal information, each individual should carefully review the privacy policies and practices of these sites. Collection of Non-Identifying Information The City of Belleville collects non-identifying information from your computer when visiting our websites. This information includes the Internet Protocol (I.P.) address, type of browser, date and time of visit, and the different webpages visited by you. This information is used strictly for statistical reporting purposes, and to design and improve access to information and services available on our websites. This information is not combined with other information or services to determine your browsing habits on websites beyond those operated by us, or to identify you personally. Cookies Cookie technology captures aggregate and not individual information on visitor use patterns. This is a computer code that tracks \"traffic\" so we can determine how effective our websites are in providing information and services to the public. A cookie contains no information that can identify you personally and the City of Belleville acquires no knowledge of your browsing path once you leave our websites. Apart from providing a performance measure, the data collected by the cookie is otherwise meaningless. Collection, Use and Disclosure of Personal Information There may be instances where your personal information is required to provide you with information or services. Where your information is required, the amount collected will be limited to the minimum amount and type necessary to provide you with the information or service requested. This information will only be used for the purposes for which it was collected and will not be used to create an individual profile or combined with other information held by the City to create a new database of information. Where the collection occurs a notice will state the legal authority, purpose and the name, address and phone number of the individual who can answer questions regarding the collection. The personal information that you provide will be used, protected and disclosed only in accordance with the Municipal Freedom of Information and Protection of Privacy Act. Accessibility The City of Belleville is committed to creating an accessible online environment and to making its web documents available to everyone. However, there may be instances where not all content is in an accessible format such as maps or Geographic Information System (G.I.S.) data; engineering drawings or complex technical data; and legacy applications or data. Should you need assistance in obtaining an accessible alternative for non-accessible content, contact Service Belleville. Copyright, Trademark and Visual Identity All contents of the City's online sites is Copyright © 2015 the City of Belleville and/or its suppliers, 169 Front St. Belleville, Ontario K8N2Y8. All rights reserved. No trademark or service mark licence is granted in connection with the materials contained on the City's online sites. The City of Belleville Logo is a registered trademark of The Corporation of the City of Belleville. Any reproduction of the Logo without the City of Belleville's expressed permission is prohibited. Personal and Non-Commercial Use Limitation The City's websites are for your personal and non-commercial use. Unless specifically authorized by The Corporation of the City of Belleville, you may not modify, copy, distribute, transmit, display, perform, reproduce, publish, licence, create derivative works from, transfer, or sell any information, software, products or services obtained from this website. No Unlawful or Prohibited Use As a condition of your use of the City's websites, you warrant to the City of Belleville that you will not use these websites for any purpose that is unlawful or prohibited by these Terms of Use. Links to External Sites For convenience purposes, our online sites may contain links to external websites operated by third-parties (e.g. Events & Meetings Online Calendar). The purpose of providing these external links is for your convenience and to avoid duplicating information that is already being maintained by a source organization elsewhere online. Links to external websites contain information created, published, maintained, or otherwise posted by institutions or organizations independent of the City. The City does not endorse, approve, certify, or control external websites and does not guarantee the accuracy, completeness, efficiency, timeliness or correctness of the information located on third-party websites. Reference to any third-party product, service, event or publication does not constitute or imply endorsement, recommendation or favouring by the City of Belleville, its employees and/or Council members. Social Media accounts The City's social media accounts, including but not limited to Twitter, Facebook, YouTube, Instagram, and LinkedIn, serve as a mechanism for disseminating information in a timely manner and enhancing the City's ability to share community news with a wide audience. Third-party content (including community event information, comments and external links) posted on the City's social media accounts does not necessarily reflect the opinions and position of the City of Belleville, its employees and/or Council members. The City reserves the right to not post or to delete comments, links and other content that: are not topically related to the particular message or online site being commented upon are spam include foul language or vulgarities are offensive to an individual or an organization, rude in tone, or abusive solicit/advertise/promote particular services, products, or political individuals, political campaigns, advocacy groups or organizations infringe on copyrights or trademarks Connect Belleville What Personal Information Do We Collect? No personal information is collected in order to view the Connect Belleville website (the Site); however should you wish to participate in the discussions, surveys or engagement opportunities, you may need a Connect Belleville account. In order to create an account, the following information is required: Email address Username/screen name Password Postal code Date of birth The City of Belleville will maintain the confidentiality of your email address, password, postal code and date of birth. Your use of Connect Belleville may also result in the collection of additional personal information about you, including your opinions on a particular matter or any other personal details you choose to volunteer. Please remember that the information on Connect Belleville is publicly accessible and any information you post or opinions you provide may be viewed by any other visitor to the Site. How will my personal information be used? Your personal information will be used to provide you with access to the engagement tools within the Site and receive your feedback on specific campaigns or issues. It may be used to identify engagement opportunities which may be of interest to you arising from your self-identified location, or age. Your feedback will be used to improve City services and to develop better public policy addressing issues of significance to Belleville residents. Results from engagement campaigns will be analyzed and interpreted at the discretion of the City of Belleville. Your information will not be used by the City in any other manner other than as noted within this policy. Will you send me emails? Yes, the City of Belleville will use email communications to notify you of engagement campaigns you may be interested in. You may choose to opt out, or unsubscribe from these emails at any time using the unsubscribe link included in each email. Will you sell or share my personal information? The City of Belleville will never sell your personal information. As a local government in Ontario, we are subject to the Municipal Freedom of Information and Protection of Privacy Act, which imposes a general prohibition against the disclosure of personal information, except in limited and specific instances. The City of Belleville may be required to disclose your personal information; however we will only ever do so as required by law. For more information on the Municipal Freedom of Information and Protection of Privacy Act, you are invited to review the legislation on the Province of Ontario's e-Laws website. Connect Belleville is built upon the E-Solutions platform provided. As the service provider, E-Solutions is responsible for managing and monitoring elements of the Site and will have access to the personal information submitted by you; however they are not permitted to sell, mine or use your personal information other than as noted within this privacy policy. Do you collect non-identifying information? Yes, Connect Belleville collects non-identifying information including: Your internet protocol (I.P.) address; The type of web browser you have used to access the site; The date and time of your visit; Any documents you have downloaded from the library; and, Any videos or pages you have viewed on Connect Belleville. How is this non-identifying information used? The non-identifying information is used for statistical reporting purposes and to understand how site visitors are using the site. This information will be used to guide enhancements to the tools, services and information available on Connect Belleville. This information will not be combined with any other information or service to determine your browsing habits on other websites, or to identify you personally. Who can I contact for more information? More information on the Connect Belleville privacy policy beyond what is noted below can be obtained by contacting the City's Freedom of Information Coordinator at 613-968-6481. Liability Limitations The material posted on our online sites is not an official statement of City policy, practice, services or procedure, and should not be construed as such. It is intended only to give general information about the City. While an effort is made to post only accurate information, the City does not guarantee that the information, software, products and services included on its online sites is always current or correct. In the case of a difference between the version presented online and the version in the City's records, the City's records shall be assumed to be correct. Advice received via this website should not be relied upon for personal, medical, legal or financial decisions and you should consult an appropriate professional for specific advice tailored to your situation. The City and/or its respective suppliers may make improvements and/or changes to our online sites at any time. The City and/or its respective suppliers make no representations about the suitability, reliability, timeliness, and accuracy of the information, software, products, services and related graphics contained on this website for any purpose. All such information, software, products, services and related graphics are provided \"as is\" without warranty of any kind. The City of Belleville and/or its respective suppliers hereby disclaim all warranties and conditions with regard to this information, software, products, services and related graphics, including all implied warranties and conditions of merchantability, fitness for a particular purpose, title and non-infringement. In no event shall the City and/or its suppliers be liable for any direct, indirect, punitive, incidental, special, consequential damages or any damages whatsoever including, without limitation, damages for loss of use, data or profits, arising out of or in any way connected with the use or performance of our online sites, with the delay or inability to use our online sites, the provision of or failure to provide services, or for any information, software, products, services and related graphics obtained through our online sites, or otherwise arising out of the use of our online sites, whether based on contract, tort, strict liability or otherwise. If you are dissatisfied with any portion of our websites or online accounts, or with any of these terms of use, your sole and exclusive remedy is to discontinue using our website or online account. City of Belleville Online Calendar - Posting Criteria The purpose of the City's online calendar is to inform the public about upcoming events in their community and to provide an opportunity to promote community and local meetings and events. Postings are allowed based on the following criteria Events must be held in Belleville or, alternatively, hosted by a Belleville-based organization, Postings cannot be entered more than 12 months in advance, Postings must include at least one contact source (phone number, email address, website url), Events must be open to all members of the public, Both free and ticketed events are eligible; however, if there is a fee, the amount must be included in the posting, Postings are limited to 3 per month per organization, and If there are age restrictions associated with a posting, they are to be included in the details. The City will not approve postings that are: Personal fundraisers, Political in nature, Discriminatory to an individual or group, Faith based ceremonies or teachings, Postings that conflict with any laws, City by-laws, policies or City programs, Information workshops for the purpose of soliciting customers*, For the sale of products or services unless a portion of the proceeds are being donated to a not-for-profit organization in Belleville (Note: the local not-for-profit organization must submit the listing)*, Yard sales or rummage sales unless a portion of the proceeds are being donated to a not-for-profit organization in Belleville (Note: the local not-for-profit organization must submit the listing), or Events for organizations that do not have the required City permits or licences. * These restrictions are waived for postings included in The Arts category within the Festivals and Events calendar and in the Business Events and Workshops calendar. Disclaimer: The City of Belleville reserves the right to deny submissions at its sole discretion. The inclusion of a posting does not imply endorsement by the City of Belleville. The City of Belleville accepts no responsibility for the information contained in postings made by others. The City of Belleville accepts no responsibility for any damages caused by the inclusion of incorrect or inappropriate information posted by others. The City of Belleville reserves the right to edit messages for grammar and clarity. The City of Belleville reserves the right to modify the calendar posting criteria at any time. Governing Law and Jurisdiction All matters relating to your access to, or use of, the City's websites shall be governed by the statutes and laws of the Province of Ontario. Get In Touch Stay up-to-date Subscribe to this page to get notified when this page has updated content. Notify Me Close Search Pop Up Search I Want To... Close I Want To menu Search Close Old Browser Notification Browser Compatibility Notification It appears you are trying to access this site using an outdated browser. As a result, parts of the site may not function properly for you. We recommend updating your browser to its most recent version at your earliest convenience."
  },
  {
    "municipality": "Belleville, City of",
    "source_type": "other",
    "title": "Burn Permits\n        - City of Belleville",
    "date": null,
    "source_url": "http://www.belleville.ca/en/city-hall/burn-permits.aspx",
    "text": "Close Alert Banner Burn Permits Decrease text size Default text size Increase text size Print This Page Share This Page Facebook Twitter LinkedIn Email Menu There is currently no burn ban in effect. All residents who want to set or maintain an open air fire must obtain a burn permit and follow all applicable rules as set out in Bylaw-2021-12. Request a copy of the Open Air Burning By-law. Apply for a Burn Permit See below the different types of fires and conditions that must be met for each: Campfire No person shall set or maintain a campfire unless all of the following conditions are met No person shall conduct or permit open air burning without obtaining a permit. The campfire shall occur between the hours of 5pm and 11 pm. The campfire is contained within an area of noncombustible metal, masonry. ceramic or stone or is contained with in a pit in the ground and has a maximum diameter or 60 centimeters and is located in Zone A. The material burned in the campfire is clean, dry, untreated wood in a single pile that is less than 60 centimeters in height, width and length. The campfire is located not less than six (6) metres from any building, hedge, fence, overhead wiring or other combustible material and be located 15 metres from the lot line. The person tending the campfire has tools or water adequate to contain and if required extinguish the fire within the campfire area. The fire is not set or maintained during a period identified as having a “Total Burn Ban” in place. Fire in an Outdoor Fireplace/Burning Appliance No person shall set or maintain a fire in an outdoor fireplace / burning appliance unless all of the following conditions are met: No person shall conduct open air burning without obtaining a permit. The outdoor fireplace/burning appliance is constructed of non-combustible metal, masonry, ceramic or stone on grade. The outdoor fireplace is not located on a balcony or deck. The outdoor fireplace is not located on any combustible surface. The outdoor fireplace is in good working order. The fire in the outdoor fireplace/burning appliance shall occur between the hours of 5 pm and 11 pm. The outdoor fireplace/burning appliance is located not less than three (3) metres from any structure, overhead wiring or other combustible material and be three (3) meters from the lot line. The person burns only clean, dry, untreated wood or commercial charcoal in the outdoor fireplace. Any fire in an outdoor fireplace within the areas identified in Zone A or B, the appliance or fireplace must be equipped with a spark screen or cover with a maximum opening of 13mm, and flames shall not extend more than 15 cm through and above the spark arrestor. The fire is not set or maintained during a period identified as having a \"Total Burn Ban\" in place. Brush Fire No person shall set or maintain a brush fire unless they ensure all the following conditions are met: No person shall conduct a brush fire without obtaining a permit. The Brush fire shall occur between two (2) hours before sunset until two (2) hours after sunrise The fire is set and maintained at no less than twenty (20) metres from any building, hedge, fence, overhead wire or other combustible material, or lot line. The pile of materials to be burned in the fire do not exceed three (3) metres in length, three (3) metres in width, and three (3) metres in height. They have the necessary means immediately available at the site of the fire to permit them to extinguish the fire, to limit its spread, and if necessary, to summon Belleville Fire & Emergency Services. Brush fires are only permitted in Zone A. That the person present and in control of the Brush Fire is the person identified in the Burn Permit. Agriculture Fire No person shall set or maintain an agricultural fire unless they apply in writing to the Fire Chief for the Agricultural required burning and if they ensure all of the following conditions are met: No person shall conduct a agricultural fire without obtaining a permit. The fire is set and maintained at no less than Fifty (50) metres, from any building, hedge, fence, overhead wire or other combustible material, or lot line. The materials to be burned in the fire do not exceed five (5) metres in length, five (5) metres in width and five (5) metres in height with a maximum of four (4) piles burning simultaneously unless otherwise approved. The agricultural fire shall occur between two (2) hours before sunset and two (2) hours after sunrise The person setting the fire has the necessary means immediately available at the site of the fire to permit them to extinguish the fire, to limit its spread, and if necessary, summon Belleville Fire & Emergency Services. Agricultural Fires are only permitted in area identified as Zone A. Authorization approval issued is valid only for the time(s), conditions and day(s) set out as approved by the Chief Fire Official and has issued Authorization to Burn Permit. That the person present and in control of the Agricultural Fire is the person identified in the Authorization. Specific Event A community not-for-profit organization, school, religious Institution or a resident may apply in writing to the Fire Chief or a specific event permit to conduct open air fires for cultural, religious or recreational specific event and if they ensure all of the following conditions are met: No person shall conduct a specific event fire without obtaining a permit. All conditions as set out on the permit and approval are followed. The person or organization issued the permit has the necessary means immediately available at the site of the permit to extinguish the fire or to limit its spread and if necessary, summon Belleville Fire & Emergency Services. Authorization approval issued is valid only for the time(s) and day(s) set out on the issued Authorization to Burn. That the person present and in control of the Specific Event Fire is the person identified in the Burn Permit and/or the authorization from the Chief Fire Official. Fire in a Cooking Device No person shall set or maintain a fire in a cooking device unless they ensure all the following conditions are met: The cooking device: Is not located on a balcony of a multi-unit residential building. Is located at least one (1) metre from any building or structure; and is in good working order, and/or the clearances labelled on the device can be met. The person burns only commercial charcoal, compressed gas or wood in the cooking device, as is appropriate for the design of that cooking device. Heating During Construction No person may set or maintain a fire in a portable appliance during a construction or maintenance process unless they ensure all the following conditions are met The portable appliance is designed for that purpose. The portable appliance is only used for that purpose. The portable appliance is used in accordance with manufacturer's instructions. The portable appliance is in good working order. Burn Barrels or drums are not permitted. The below map indicates Zone A and B in the city. Use it to find your zone! Burn Permit Zones Map For any questions regarding burn permits please contact fireprevention@belleville.ca or call 613-962-2010. Get In Touch Stay up-to-date Subscribe to this page to get notified when this page has updated content. Notify Me Close Search Pop Up Search I Want To... Close I Want To menu Search Close Old Browser Notification Browser Compatibility Notification It appears you are trying to access this site using an outdated browser. As a result, parts of the site may not function properly for you. We recommend updating your browser to its most recent version at your earliest convenience."
  },
  {
    "municipality": "Belleville, City of",
    "source_type": "other",
    "title": "Marriages\n        - City of Belleville",
    "date": null,
    "source_url": "http://www.belleville.ca/en/city-hall/marriages.aspx",
    "text": "Close Alert Banner Marriages Decrease text size Default text size Increase text size Print This Page Share This Page Facebook Twitter LinkedIn Email Menu The City of Belleville is now accepting marriage licence applications through the Province of Ontario’s new online system. You can begin your application here: Apply for a marriage licence online | ontario.ca Information Required to Complete Your Marriage Licence Application To submit your application online, please ensure you have the following information and documents ready: The proposed date of your marriage (must be within 3 months/90 days of today’s date). The municipality where you will obtain your licence. The proposed place of marriage (city, town, or reserve). The full names, dates of birth, provinces/territories of birth, countries of birth (as it was known at the time of birth), addresses, and contact information for both applicants. The marital status of each applicant. Divorce certificates (required if either applicant has been previously married). The names and countries of birth (country name as it was known when the parent was born) for each applicant’s parent(s). Photographs or scans of two pieces of government-issued identification for each applicant (four pieces total). At least one piece of ID per person must include a photo. Next Steps Once your application is submitted online, you will receive an email to book your appointment online to complete and pick up your licence. For more information on marriage licences in Ontario, visit the Government of Ontario’s website. For any questions regarding a marriage licence please email marriagelicences@belleville.ca Identification provide 2 pieces of government-issued identification for each person getting married. One piece of identification for each person getting married must include their photo.Examples of government-issued identification include: government-issued birth certificate, including any change of name certificates valid passport record of immigrant landing Canadian Citizenship Card valid driver’s licence valid Ontario Photo Card valid hunting licence Age of Consent Any person who is at least 18 years old may marry in Ontario. Any person who is 16 or 17 years old (other than a widow, widower or divorced person) may only marry with the written consent of their legal guardian. A special consent form is available from the City for this purpose. Documents required if either applicant has been Divorced If you were Divorced in Canada the original or court certified copy (from the same court in which the divorce or annulment was granted), of the Final Decree or Certificate of Divorce (Form 36b) the Divorce Order is not acceptable. If you were Divorced outside of Canada If you were divorced outside of Canada, you will need to provide certain documents to prove that you are no longer married. The government needs to validate these documents. This process can take up to 4 weeks. You will need to send the following documents to ServiceOntario: marriage licence application form: completed and signed Statement of Sole Responsibility - for each divorce (signed by both people who are planning to get married and a witness) legal opinion letter: from an Ontario lawyer, addressed to both people who plan to get married, giving reasons why the divorce or annulment should be recognized in Ontario divorce decree or annulment: an original or court-certified copy in English or French. If the decree is in another language, you will need to include a translated copy and an affidavit sworn by a certified translator Please mail these documents directly to: ServiceOntarioMarriage OfficePO Box 4600189 Red River RoadThunder Bay ON P7B 6L8 For more information call 1-800-461-2156 (toll-free). How to get a Marriage Certificate after marriage A marriage certificate is a legal record of a marriage. It lists the date and place of the marriage, and names of the people who were married. You may need this document to: show legal proof you are married apply for certain social benefits settle an estate change a last name assume a last name after marriage Before you can get a marriage certificate, your marriage needs to be registered. The officiant who performed the marriage will send your completed and signed marriage licence to ServiceOntario so the marriage can be registered. You can order a marriage certificate about 6-8 weeks after this happens. Order a marriage certificate Note: A Record of Solemnization of Marriage may be provided by your marriage officiant immediately following the marriage ceremony. This is a souvenir of the marriage and is not the same thing as a marriage certificate. Marriage Ceremonies The City of Belleville does not perform civil marriage ceremonies. Get In Touch Stay up-to-date Subscribe to this page to get notified when this page has updated content. Notify Me Close Search Pop Up Search I Want To... Close I Want To menu Search Close Old Browser Notification Browser Compatibility Notification It appears you are trying to access this site using an outdated browser. As a result, parts of the site may not function properly for you. We recommend updating your browser to its most recent version at your earliest convenience."
  },
  {
    "municipality": "Belleville, City of",
    "source_type": "other",
    "title": "City Projects\n        - City of Belleville",
    "date": null,
    "source_url": "http://www.belleville.ca/en/city-hall/city-projects.aspx",
    "text": "Close Alert Banner City Projects Decrease text size Default text size Increase text size Print This Page Share This Page Facebook Twitter LinkedIn Email Menu The City of Belleville’s City Projects are now available in one centralized location. Explore current and upcoming initiatives, access detailed updates, and stay informed about developments across the community. Visit the new hub today to learn more and subscribe for notifications. Visit Get Involved Belleville Get In Touch Stay up-to-date Subscribe to this page to get notified when this page has updated content. Notify Me Close Search Pop Up Search I Want To... Close I Want To menu Search Close Old Browser Notification Browser Compatibility Notification It appears you are trying to access this site using an outdated browser. As a result, parts of the site may not function properly for you. We recommend updating your browser to its most recent version at your earliest convenience."
  },
  {
    "municipality": "Belleville, City of",
    "source_type": "council",
    "title": "Speaking Before Council or Committee\n        - City of Belleville",
    "date": null,
    "source_url": "http://www.belleville.ca/en/city-hall/council-speaking-before-council-or-committee.aspx",
    "text": "Close Alert Banner Speaking Before Council or Committee Decrease text size Default text size Increase text size Print This Page Share This Page Facebook Twitter LinkedIn Email Menu If you would like to appear before Council or a standing committee you can submit your request online or by submitting your request with the required information in writing to: City Clerk, City of Belleville, 169 Front Street, Belleville, ON K8N 2Y8. Citizens have an opportunity to provide information and express their views at City Council meetings. By-law 2019-48 (Part 7.6) outlines the procedures to be followed by those wishing to appear before Council. (1) Persons desiring to be included on the meeting agenda as a Deputation shall contact the office of the Clerk no later than 4:30 p.m. on the Tuesday preceding the date of the next Regular Council Meeting to request to be listed on the meeting agenda as a Deputation, but the Mayor may authorize a Deputation be added to the meeting agenda any time prior to finalization of the meeting agenda. The Mayor and CAO will review all deputations, including materials and presentations, as part of the Agenda setting process. Failure of a person to provide such materials by the deadline in this section or prior to the finalization of the agenda will not be authorized to make a Deputation to Council. (By-law 2024-81) (2) The number of persons appearing as a Deputation at a Regular Council Meeting shall be limited to no more than three (3) in an effort to ensure that the business of the Corporation as conducted by Council can be carried out in an efficient and effective manner. (3) Persons wishing to appear as a Deputation and who are not listed on the meeting agenda may appear as a Deputation with support from the majority of the Members present. (4) Persons appearing as a Deputation shall be limited to a maximum of 10 minutes speaking time, and where a Deputation consists of more than one person, all persons combined shall be limited to a maximum of 10 minutes speaking time, but Council may, by resolution, grant permission to any Deputation to speak for longer than 10 minutes. (5) During or following a Deputation, Members may ask specific questions relating to the presentation for the purpose of clarification without statement or comment. (6) Following a Deputation, Council shall adopt a motion: (i) to receive; or (ii) to refer to another item listed on the meeting agenda; or (iii) to refer to a committee or board or City staff for a report; or (iv) to refer to New Business for consideration. The same rules apply to appearing before any Standing Committee of Council. Get In Touch Stay up-to-date Subscribe to this page to get notified when this page has updated content. Notify Me Close Search Pop Up Search I Want To... Close I Want To menu Search Close Old Browser Notification Browser Compatibility Notification It appears you are trying to access this site using an outdated browser. As a result, parts of the site may not function properly for you. We recommend updating your browser to its most recent version at your earliest convenience."
  },
  {
    "municipality": "Belleville, City of",
    "source_type": "council",
    "title": "Speaking Before Council or Committee\n        - City of Belleville",
    "date": null,
    "source_url": "http://www.belleville.ca/en/city-hall/council-speaking-before-council-or-committee.aspx?_mid_=41334",
    "text": "Close Alert Banner Speaking Before Council or Committee Decrease text size Default text size Increase text size Print This Page Share This Page Facebook Twitter LinkedIn Email Menu If you would like to appear before Council or a standing committee you can submit your request online or by submitting your request with the required information in writing to: City Clerk, City of Belleville, 169 Front Street, Belleville, ON K8N 2Y8. Citizens have an opportunity to provide information and express their views at City Council meetings. By-law 2019-48 (Part 7.6) outlines the procedures to be followed by those wishing to appear before Council. (1) Persons desiring to be included on the meeting agenda as a Deputation shall contact the office of the Clerk no later than 4:30 p.m. on the Tuesday preceding the date of the next Regular Council Meeting to request to be listed on the meeting agenda as a Deputation, but the Mayor may authorize a Deputation be added to the meeting agenda any time prior to finalization of the meeting agenda. The Mayor and CAO will review all deputations, including materials and presentations, as part of the Agenda setting process. Failure of a person to provide such materials by the deadline in this section or prior to the finalization of the agenda will not be authorized to make a Deputation to Council. (By-law 2024-81) (2) The number of persons appearing as a Deputation at a Regular Council Meeting shall be limited to no more than three (3) in an effort to ensure that the business of the Corporation as conducted by Council can be carried out in an efficient and effective manner. (3) Persons wishing to appear as a Deputation and who are not listed on the meeting agenda may appear as a Deputation with support from the majority of the Members present. (4) Persons appearing as a Deputation shall be limited to a maximum of 10 minutes speaking time, and where a Deputation consists of more than one person, all persons combined shall be limited to a maximum of 10 minutes speaking time, but Council may, by resolution, grant permission to any Deputation to speak for longer than 10 minutes. (5) During or following a Deputation, Members may ask specific questions relating to the presentation for the purpose of clarification without statement or comment. (6) Following a Deputation, Council shall adopt a motion: (i) to receive; or (ii) to refer to another item listed on the meeting agenda; or (iii) to refer to a committee or board or City staff for a report; or (iv) to refer to New Business for consideration. The same rules apply to appearing before any Standing Committee of Council. Get In Touch Stay up-to-date Subscribe to this page to get notified when this page has updated content. Notify Me Close Search Pop Up Search I Want To... Close I Want To menu Search Close Old Browser Notification Browser Compatibility Notification It appears you are trying to access this site using an outdated browser. As a result, parts of the site may not function properly for you. We recommend updating your browser to its most recent version at your earliest convenience."
  },
  {
    "municipality": "Brampton, City of",
    "source_type": "council",
    "title": "City of Brampton",
    "date": null,
    "source_url": "http://www.brampton.ca/en/pages/welcome.aspx",
    "text": "<iframe src=\"https://www.googletagmanager.com/ns.html?id=GTM-TFFSCBW\" height=\"0\" width=\"0\" style=\"display:none;visibility:hidden\"></iframe> Skip to Content ENSection Menu What You Need To Know When It Snows Brampton has declared a Significant Weather Event. Learn about our snow clearing service levels and how to stay safe!Learn More about the What You Need To Know When It Snows Budget 2026Share your feedback to help shape the City’s proposed budget! Join our upcoming tele town hall and coffee chats.Learn More about the Budget 2026Winter in the CityMake the most of winter in Brampton with free events, activities, and outdoor adventures! Learn More about the Winter in the CityTourism Sponsorship GrantApply now for Brampton’s Tourism Sponsorship Program supporting festivals and amateur sport events. Learn More about the Tourism Sponsorship GrantRenting In BramptonExplore safe, legal and accessible housing options while learning your rights and responsibilities as a tenant or landlord.Learn More about the Renting In BramptonPreviousNextCompliance Detailsjavascript:if (typeof CalloutManager !== 'undefined' && Boolean(CalloutManager) && Boolean(CalloutManager.closeAll)) CalloutManager.closeAll(); commonShowModalDialog('{SiteUrl}'+ '/_layouts/15/itemexpiration.aspx' +'?ID={ItemId}&List={ListId}', 'center:1;dialogHeight:500px;dialogWidth:500px;resizable:yes;status:no;location:no;menubar:no;help:no', function GotoPageAfterClose(pageid){if(pageid == 'hold') {STSNavigate(unescape(decodeURI('{SiteUrl}'))+ '/_layouts/15/hold.aspx' +'?ID={ItemId}&List={ListId}'); return false;} if(pageid == 'audit') {STSNavigate(unescape(decodeURI('{SiteUrl}'))+ '/_layouts/15/Reporting.aspx' +'?Category=Auditing&backtype=item&ID={ItemId}&List={ListId}'); return false;} if(pageid == 'config') {STSNavigate(unescape(decodeURI('{SiteUrl}'))+ '/_layouts/15/expirationconfig.aspx' +'?ID={ItemId}&List={ListId}'); return false;} if(pageid == 'tag') {STSNavigate(unescape(decodeURI('{SiteUrl}'))+ '/_layouts/15/Hold.aspx' +'?Tag=true&ID={ItemId}&List={ListId}'); return false;}}, null);0x00x1ContentType0x01898Document Set Version History/_layouts/15/images/versions.gif?rev=44javascript:SP.UI.ModalDialog.ShowPopupDialog('{SiteUrl}'+ '/_layouts/15/DocSetVersions.aspx' + '?List={ListId}&ID={ItemId}')0x00x0ContentType0x0120D520330Send To other location/_layouts/15/images/sendOtherLoc.gif?rev=44javascript:GoToPage('{SiteUrl}' + '/_layouts/15/docsetsend.aspx' + '?List={ListId}&ID={ItemId}')0x00x0ContentType0x0120D520350 Featured Content Council Live StreamRecreation RegistrationAutomated Speed EnforcementExperience Brampton Brampton TransitProperty TaxesParkingGarbage and Recycling Jan 16,2026City of Brampton continues extensive snow clearing operation following nearly 40 centimetres of snowfallJan 16,2026Brampton recognized as a national leader during Culture Days 2025Jan 14,2026City of Brampton prepared for significant snowfall; shares safety reminders and resources for residentsJan 13,2026City of Brampton shares health and safety guidance as deceased waterfowl are found around two local ponds View all NewsJan 16,2026City of Brampton continues extensive snow clearing operation following nearly 40 centimetres of snowfallJan 16,2026Brampton recognized as a national leader during Culture Days 2025Jan 14,2026City of Brampton prepared for significant snowfall; shares safety reminders and resources for residentsJan 13,2026City of Brampton shares health and safety guidance as deceased waterfowl are found around two local ponds Contact 311AccessibilityFestivals and EventsFollow City of Brampton on Social MediaLet's Connect!City NewslettersCompliance Detailsjavascript:if (typeof CalloutManager !== 'undefined' && Boolean(CalloutManager) && Boolean(CalloutManager.closeAll)) CalloutManager.closeAll(); commonShowModalDialog('{SiteUrl}'+ '/_layouts/15/itemexpiration.aspx' +'?ID={ItemId}&List={ListId}', 'center:1;dialogHeight:500px;dialogWidth:500px;resizable:yes;status:no;location:no;menubar:no;help:no', function GotoPageAfterClose(pageid){if(pageid == 'hold') {STSNavigate(unescape(decodeURI('{SiteUrl}'))+ '/_layouts/15/hold.aspx' +'?ID={ItemId}&List={ListId}'); return false;} if(pageid == 'audit') {STSNavigate(unescape(decodeURI('{SiteUrl}'))+ '/_layouts/15/Reporting.aspx' +'?Category=Auditing&backtype=item&ID={ItemId}&List={ListId}'); return false;} if(pageid == 'config') {STSNavigate(unescape(decodeURI('{SiteUrl}'))+ '/_layouts/15/expirationconfig.aspx' +'?ID={ItemId}&List={ListId}'); return false;} if(pageid == 'tag') {STSNavigate(unescape(decodeURI('{SiteUrl}'))+ '/_layouts/15/Hold.aspx' +'?Tag=true&ID={ItemId}&List={ListId}'); return false;}}, null);0x00x1ContentType0x01898Document Set Version History/_layouts/15/images/versions.gif?rev=44javascript:SP.UI.ModalDialog.ShowPopupDialog('{SiteUrl}'+ '/_layouts/15/DocSetVersions.aspx' + '?List={ListId}&ID={ItemId}')0x00x0ContentType0x0120D520330Send To other location/_layouts/15/images/sendOtherLoc.gif?rev=44javascript:GoToPage('{SiteUrl}' + '/_layouts/15/docsetsend.aspx' + '?List={ListId}&ID={ItemId}')0x00x0ContentType0x0120D520350 Social Media Image"
  }
]